{
  "pronunciation": {
    "A1-A2": {
      "strength": [
        "能清楚念出常見的單字。",
        "在簡單句子中，能在重要的詞彙上稍微加重語氣。",
        "基本的韻母(母音)的發音大致正確。",
        "能辨認並模仿基本的語調起伏。",
        "送氣音與不送氣音（如 b / p）大多能分辨出來。",
        "能相當準確地跟讀生字或生詞。",
        "只要專注聽，就能模仿老師的發音。",
        "發現自己唸錯時，會主動嘗試修正。"
      ],
      "weakness": [
        "不熟悉的發音往往不太容易發好",
        "單字的聲調有時還抓不太準",
        "翹舌音(zh,ch,sh,r)的發音較不穩定。",
        "語調變化還不夠自然，多半較平",
        "發音類似的單字有時容易唸錯。（如：四/十）",
        "說話速度偏慢，常帶有明顯的遲疑。",
        "語詞連在一起說時較難掌握發音的變化。",
        "不熟悉的發音有時會發不清楚或刻意省略。"
      ]
    },
    "B1-B2": {
      "strength": [
        "大多數單字都能清楚發音。",
        "需要時能刻意調整發音讓對方聽清楚。",
        "對常見的單字聲調規律有基本掌握並能運用。",
        "能在句尾使用適當的升降語調表達意思。（例:是喔！↓、是嗎？↑）",
        "在句中能自然連接部分音節，使語流較順。",
        "對句子的基本節奏與停頓位置已有一定概念。",
        "對多數聽者來說，發音大致清楚易懂。",
        "發現自己發音不準確時，能主動修正。"
      ],
      "weakness": [
        "較少聽到或較複雜的單字偶爾仍會唸錯。",
        "句子中的聲調有時不夠自然。",
        "有時說得過快，導致咬字不夠清楚。",
        "語速較快時，發音會變得較不穩定。",
        "句子較長時偶爾會漏掉詞單字的音或唸得太輕。",
        "詞彙串起來說時，有時顯得不自然。",
        "在較快節奏的對話中，流暢度仍有提升空間。",
        "面對特定的聲調或口音時，聽與模仿上偶爾仍有困難。"
      ]
    },
    "C1-C2": {
      "strength": [
        "整體發音接近母語者水準。",
        "能有效加重發音或用語調來傳達意思或情感。",
        "較難的詞彙也多能清楚念出。",
        "能依正式或非正式場合調整說話的發音風格。",
        "對細微的發音差異有良好辨識能力。",
        "能很自然地發音並銜接語句，不會逐字唸。",
        "討論中能視需要調整發音，讓表達更清楚。",
        "能模仿接近母語者的說話流暢度與節奏。",
        "對多種不同的口音大致都能適應自如。",
        "在各種情境中發音自然、說話流暢。"
      ],
      "weakness": [
        "偶爾會模仿出略顯不自然的口音。",
        "某些音有時會發得過重。",
        "少見或較特殊字的發音有時仍不夠穩定。",
        "有些單字的發音偶爾會過於刻意、太用力。",
        "當語速非常快時，有時不易正確掌握細微的發音差異。",
        "一般發音幾乎沒有問題，但遇到外來專有名詞或是專業名詞時仍會稍微猶豫。",
        "偶爾會過度糾正自己的發音，使得整體流暢度受影響。",
        "有時過度追求發音完美，而影響整體自然度。",
        "遇到較少聽到的口音時，仍需要一段適應時間。",
        "專業術語的聲調與表達上仍偶有錯誤。"
      ]
    }
  },
  "vocabulary": {
    "A1-A2": {
      "strength": [
        "在日常情境中具備基本的詞彙量。",
        "能使用常見的名詞、動詞與形容詞。",
        "能辨認並理解熟悉的事物或主題。",
        "能夠簡單描述身邊的人與地方。",
        "能夠談論基本的日常作息。",
        "能用簡單的詞彙提出基本問題。",
        "能理解一些基礎的常用表達。",
        "對日常生活中常見的基本詞彙能正確掌握。"
      ],
      "weakness": [
        "在表達想法時可使用的詞彙範圍有限。",
        "需要他人協助才能找到合適的詞句。",
        "在說話時經常難以及時想起單字。",
        "在使用同義詞或近義詞方面有困難。",
        "經常重複使用相同的單字。",
        "難以清楚表達抽象概念或情緒感受。",
        "對陌生主題的描述能力有限。",
        "在對話中需要更精確與多樣的詞彙來支援表達。"
      ]
    },
    "B1-B2": {
      "strength": [
        "能使用適當的詞彙清楚表達自己的意見。",
        "只要稍加準備，就能說明常見的概念。",
        "能辨別並運用部分常見的慣用語。",
        "能夠較詳細地描述自己的經驗。",
        "能運用形容詞與副詞讓表達更具體更豐富。",
        "能夠很輕鬆地談論大多數熟悉的主題。",
        "在協助下，也能談論較不熟悉的主題。",
        "能夠談論個人經驗或未來計畫。"
      ],
      "weakness": [
        "在較細微的語感或專業的用字上仍有所不足。",
        "在表達複雜想法時，常難以找到最貼切的詞語。",
        "在某些社交情境所需的詞彙仍不夠充分。",
        "口語表達時，偶爾無法立刻想起某些單字。",
        "在詞語搭配與固定用法上仍有困難。",
        "需要加強並多練習進階且自然的詞彙。",
        "在較複雜的話題中，偶爾會重複使用相同的詞彙。",
        "在較專業或正式的對話中，仍常依賴較基本的詞語。"
      ]
    },
    "C1-C2": {
      "strength": [
        "在談論複雜的主題時，也能使用相當廣泛的詞彙。",
        "能夠清楚且詳細地表達想法與意見。",
        "能很輕鬆地使用慣用語與口語表達。",
        "能依據情境與對象調整用字遣詞。",
        "能運用高階的形容詞與副詞讓表達更豐富。",
        "能夠流暢地描述抽象概念。",
        "能以精確的詞語表達自己的立場與觀點。",
        "能自然運用常見的詞語搭配詞與固定組合。",
        "即使在學術或正式場合，也能使用適當的詞彙。",
        "能輕鬆討論各種廣泛主題。"
      ],
      "weakness": [
        "偶爾會在語境中使用不正確的詞語。",
        "有時表達會變得過度複雜。",
        "在專業或特定領域的專門詞彙上仍有進步空間。",
        "在極為高階的專業術語上有時仍感吃力。",
        "雖然錯誤不多，但有時仍可能顯得用字重複。",
        "偶爾會錯置或誤用複雜詞彙。",
        "在日常對話中，有時會使用過於詳細的表達。",
        "在高階學術或專業主題上，仍可再加強細節的描述與準確度。",
        "偶爾會對罕見詞彙的用法感到不確定。",
        "有時會超出情境所需使用過度正式的表達。"
      ]
    }
  },
  "listening": {
    "A1-A2": {
      "strength": [
        "能聽懂日常常用的詞語和表達。",
        "語速放慢、發音清楚時，大致能聽懂。",
        "能根據上下文聽出熟悉的單字。",
        "能聽懂基本的問候語和簡單問題。",
        "課堂上的簡單指示多半能聽懂。",
        "能聽懂短且簡單的句子。",
        "聽的時候能抓住幾個關鍵詞。",
        "能聽懂簡單的請求或要求。",
        "能聽懂以「是／不是」來回答的基本問句。"
      ],
      "weakness": [
        "口說內容需要重複幾次才比較聽得懂。",
        "偏快或較自然的語速常常跟不上。",
        "較長的對話中，細節部分容易聽漏。",
        "不同口音或腔調的發音不太容易聽懂。",
        "有圖片或肢體等視覺輔助時會比較容易聽懂。",
        "即使聽懂部分內容，也不一定能掌握全部的意思。",
        "對連音或縮短的口語發音較難聽懂或分辨。(例如：了啊=啦)",
        "需要多一點時間消化剛聽到的內容。"
      ]
    },
    "B1-B2": {
      "strength": [
        "能大概聽懂一般的對話。",
        "若是熟悉的主題，就算是普通語速也多半能聽懂。",
        "在輕鬆的對話中，能大致判斷出說話者想傳達的意思。",
        "能分辨較正式與較口語的說話語氣。",
        "結構清楚、內容簡單的故事大致能聽懂。",
        "只要稍微專注，就能聽懂基本的說明與解釋。",
        "在較長的談話中也能抓到主要重點.",
        "在多數日常情境中，能應付基本的聽力需求。",
        "一般的廣播與指示內容大多能聽懂。"
      ],
      "weakness": [
        "話中隱含的意思有時不容易聽出來。",
        "對於慣用語與自然口語的理解力仍需要加強。",
        "面對內容較複雜的討論時，偶爾會產生誤解。",
        "口音或地方腔較重時，理解會變得困難。",
        "說話節奏很快的討論往往跟不上。",
        "在較專業或較複雜的主題，常需要額外的補充說明才能理解。",
        "對話主題在慢慢改變時，有時無法馬上察覺。",
        "帶有玩笑或反諷語氣的說法有時聽不太出來。",
        "語速很快又夾雜很多一般口語說法或俚語時，理解會變得比較吃力。"
      ]
    },
    "C1-C2": {
      "strength": [
        "能聽懂大多數母語者自然偏快的語速。",
        "能分辨出說話語氣中的細微變化。",
        "能理解話語背後隱藏的含意與語氣差異。",
        "能輕鬆跟上新聞、課堂講解和一般討論。",
        "能聽懂帶有幽默、諷刺或反諷意思的說法。",
        "能理解多人的辯論或座談會的內容。",
        "能理解較複雜的學術或專業領域的聽力內容。",
        "即使在吵雜的環境下，也多半能聽懂對話內容。",
        "無論是正式或非正式的說話方式都很習慣且容易理解。",
        "能從聲音的抑揚頓挫和聲調中分辨出情緒與態度。"
      ],
      "weakness": [
        "口音非常重的說話方式有時仍較難聽懂。",
        "有些需要先知道特定文化背景才能理解的表達，有時無法完全明白。",
        "有時會過度解讀說話內容，反而變得更難理解。",
        "對於高難度的專業術語，理解上仍有一定難度。",
        "多人同時發言時，偶爾難以分辨各自的內容。",
        "對不熟悉的方言仍需要一些時間適應。",
        "高度抽象或哲學性的討論仍然較難理解。",
        "對於刻意含糊的表達，有時會理解錯誤而造成誤解。",
        "對慣用語細微的變化與替換，有時不易察覺差異。",
        "對語氣細微變化有時會解讀過度。"
      ]
    }
  },
  "grammar": {
    "A1-A2": {
      "strength": [
        "能造出簡單句子。",
        "能正確使用時態。",
        "能使用疑問詞造基本的問句。",
        "能用基本句型來描述日常作息。",
        "能使用基本形容詞。",
        "能夠造出正確的疑問句。",
        "能用基礎句型表達身分、狀態與位置（是／在／有）。",
        "能運用與日常行為相關的常用動詞（如吃、去、買等）。",
        "能用「能／可以／會」「應該」等基本表達來說明能力、許可與建議。"
      ],
      "weakness": [
        "語序的運用上有困難。",
        "用於動詞前後，表達時態的副詞與助詞常用錯。",
        "在表達時間、地點、方向或對象等關係的語詞運用上有困難。",
        "常常省略或不太會用修飾動詞與形容詞的程度副詞。",
        "量詞的使用與數字說法仍不穩定（一本書、一瓶酒、十二、兩百等）。",
        "連接詞的運用需要協助。",
        "容易混淆現在式與過去式。",
        "主謂(S+V)一致的運用有待加強。",
        "同時運用多種時態時會感到困難。"
      ]
    },
    "B1-B2": {
      "strength": [
        "能穩定運用多種時態。",
        "能很順暢地連接句子並寫出結構完整的長句。",
        "能依情境使用適當的被動語句。",
        "能正確使用轉述（間接引語）的句型。",
        "理解各類條件句並能正確運用（例:如果〜、要不然〜、要不是〜）。",
        "在理解語意後，能將句子改寫為「把」字句。",
        "能依語境準確表達比較或程度（如：A 比 B～、更／較～、最～、沒有 B 那麼～、跟 B 一樣～）。",
        "能以得體的語氣表達請求並使用間接問句。",
        "能運用連接詞使段落與脈絡清晰流暢。",
        "能以名詞修飾結構並正確拉長句子（如動詞／形容詞＋「的」、關係子句：主語＋述語＋的＋名詞），並依語境選擇恰當的「的」字結構。"
      ],
      "weakness": [
        "有時會把不同時態混在一起使用。",
        "在高階或較複雜的條件句上感到吃力。",
        "主詞與動詞一致的用法仍常出錯。",
        "文法整體的正確度有時不穩定。",
        "名詞前的修飾語或句子有時語序顛倒導致語意不清。",
        "動詞搭配與複合結構（動補／結果・程度補語、趨向補語）的運用仍需加強。",
        "名詞的指稱與界定（定指／非定指）、指示詞（這／那）與量詞選用的掌握不穩。",
        "有時過度依賴簡單句式。",
        "在句子中，偶爾會漏掉用來表示時間、地點或方向的詞語（例如「在」「到」「從」等）。",
        "正式與非正式說法拿捏得不夠穩定。"
      ]
    },
    "C1-C2": {
      "strength": [
        "能有效運用各種高階句型與較複雜的句子結構。",
        "在各種時態的使用上都能維持很高的正確度。",
        "能正確運用語序倒裝來加強語氣或突出重點。",
        "能透過表示可能性、義務、推測等的語氣表達細微差異。",
        "能理解並能自然地運用較複雜的名詞修飾子句（關係子句）。",
        "能流暢使用較高階的連接詞與銜接語，使論述更有層次。",
        "在各種情境與句型中都能維持自然且正確的語序。",
        "能運用多樣的句子結構與句型，使表達更有變化。",
        "能在正式與非正式說法間切換自如。",
        "即使在流暢且快速的表達下，也能維持高度的語法正確度。"
      ],
      "weakness": [
        "在造句時，句子結構有時會過於複雜。",
        "有時過度依賴被動句式，而不是使用更自然的主動表達。",
        "在造較高階或較複雜的假設句子上，偶爾會有用法不當的情況。",
        "在較少見或較特殊的語法結構上，仍需要加強練習與調整。",
        "在非常正式的說法或書面語中，偶爾會選用不夠自然或不夠貼切的表達。",
        "在輕鬆的對話中，有時會使用過於書面或過度複雜的句型。",
        "在使用慣用或固定用法的細微語法上，仍可能感到困難。",
        "有時過度在意語法細節，導致表達不夠自然或不夠流暢。",
        "語法使用錯誤時，無法自行立即做修正。",
        "遇到不常用或較生僻的語法時，偶爾會顯得猶豫或不太確定。"
      ]
    }
  },
  "speaking": {
    "A1-A2": {
      "strength": [
        "能在基礎對話中清楚表達。",
        "能夠做簡單的自我介紹。",
        "能夠回答簡單的問題。",
        "能運用簡單的短語來表達。",
        "能夠用簡單的句子請求基本的協助。",
        "能簡單描述熟悉的物品。",
        "能夠表達自己喜歡或不喜歡的事物。",
        "能夠談論日常生活中熟悉的主題。"
      ],
      "weakness": [
        "在某些情況下，用字遣詞可能顯得過於複雜難以理解。",
        "有時會過度詳細說明，導致表達偏長。",
        "幾乎不太猶豫，但在非常複雜的回答上仍會稍微停頓。",
        "在高度複雜的文法結構中仍可能出現少許錯誤。",
        "有時會過度在意某些回答或句型是否完美。",
        "偶爾會使用過於複雜的詞語或句型。",
        "說話速度過快時，表達清晰度可能略有下降。",
        "有時會過度鋪陳或偏離主題。"
      ]
    },
    "B1-B2": {
      "strength": [
        "能夠參與時間較長的對話。",
        "能比以前運用更豐富的詞彙來表達。",
        "能清楚解釋常見的基本概念。",
        "能針對問題作比較詳細的回答。",
        "經過思考與整理後，能回答突發的提問。",
        "能自然流暢地描述個人經驗。",
        "能夠參與簡單的辯論或意見交換。",
        "能夠大致整理並口頭總結重點。"
      ],
      "weakness": [
        "對不熟悉的主題仍然會有些猶豫。",
        "談論抽象概念時，有時表達不夠清楚。",
        "在思考適當詞語時常常停頓。",
        "在使用複雜的語法架構時仍感到吃力。",
        "即興對話時，流暢度有時不足。",
        "有時會重複使用相同的詞彙或短句。",
        "需要一些時間來整理並組織自己的想法。",
        "在複雜主題中，仍可能過度依賴簡單說法。"
      ]
    },
    "C1-C2": {
      "strength": [
        "能靈活運用多樣且複雜的句型結構。",
        "能在即興情境中清楚表達自己的想法。",
        "能自在討論各種廣泛的主題。",
        "在口頭表達時，思路結構通常非常清楚。",
        "能有效表達抽象或複雜的想法。",
        "能依不同對象調整自己的說話風格。",
        "能在正式與非正式的場合中暢所欲言。",
        "慣用語與口語表達運用自如。"
      ],
      "weakness": [
        "在某些情況下，用字遣詞可能顯得過於複雜難以理解。",
        "有時會過度詳細說明，導致表達偏長。",
        "幾乎不太猶豫，但在非常複雜的回答上仍會稍微停頓。",
        "在高度複雜的文法結構中仍可能出現少許錯誤。",
        "有時會過度在意某些回答或句型是否完美。",
        "偶爾會使用過於複雜的詞語或句型。",
        "說話速度過快時，表達清晰度可能略有下降。",
        "有時會過度鋪陳或偏離主題。"
      ]
    }
  },
  "accuracy": {
    "A1-A2": {
      "strength": [
        "能夠在一定程度上正確運用基礎文法結構。",
        "可以用主語–謂語–賓語(SVO)的形式造出非常簡單的句子。",
        "時態的用法整體上相當正確。",
        "能夠在一定程度上一致地使用基本人稱代名詞。",
        "察覺到錯誤時，會努力加以修正。",
        "有時能夠自行修正非常簡單的錯誤。",
        "對基本語序的概念正在逐漸形成。",
        "模仿例句來造句時，整體上能夠相當正確地表達。"
      ],
      "weakness": [
        "即使在簡單句子中也經常出現文法錯誤。",
        "有時會因為錯誤而導致意思不夠清楚。",
        "在使用過去式與未來式時感到困難。",
        "句子中常常省略或錯用各種小品詞（如介詞、連詞等），例如用來標示時間、數量或語法關係的詞語。",
        "常常無法正確區分單數與複數形式。",
        "語序經常受到母語影響而顯得不自然。",
        "需要協助才能察覺並修正重複出現的錯誤。",
        "即使是基本的字上也經常書寫錯誤。"
      ]
    },
    "B1-B2": {
      "strength": [
        "對於熟悉的文法句型，大致能夠相當正確地進行口說與書面表達。",
        "過去、現在與未來等時間表達能在一定程度上正確運用。",
        "即使有錯誤，通常也不會對溝通造成嚴重阻礙。",
        "如果有時間，會自己重新檢查並修正錯誤。",
        "能相當準確地使用表示並列、轉折、原因等基本連接詞來連結句子並表達想法。",
        "能意識到自己常犯的錯誤，並主動努力加以避免。",
        "在許多情況下，能正確選用名詞、動詞、形容詞等詞語的形式。",
        "常用字與詞彙的書寫大多是正確的。"
      ],
      "weakness": [
        "在較複雜的時態或文法結構上，仍然經常出現錯誤。",
        "在表示時間、地點或句子內關係的小品詞（如介詞、連詞、語氣助詞等）的使用上，時常出錯。",
        "句子一長，語序有時就會變得混亂或不自然。",
        "說話或寫作速度一快，文法正確度就有明顯下降的傾向。",
        "某些文法錯誤至今依然像習慣一樣反覆出現。",
        "有時會混淆用來表達時間（例如「又--了」「又要--了」等過去與未來）的相似文法結構。",
        "若要運用較精確或細微的文法句型，仍需要教師的指導與協助。",
        "造較複雜的句子時，常會出現一兩處明顯的文法錯誤。"
      ]
    },
    "C1-C2": {
      "strength": [
        "整體而言能維持非常高的文法正確度。",
        "即使出現錯誤，也很少，而且多半只是細微的小問題。",
        "能穩定運用各種複雜的句子結構。",
        "能依情境正確使用時態與動作狀態（例如進行、完成等）。",
        "即使用較不熟悉的詞彙，大致上也能選擇正確的用法。",
        "在書寫時字跟選用的詞句幾乎總是正確的。",
        "能自行察覺並修正細微的錯誤。",
        "能依場合（正式／非正式）來調整語氣與表達方式。"
      ],
      "weakness": [
        "在非常複雜或極少用到的句型與結構上，仍偶爾會出錯。",
        "用來連接句子的連詞，或修飾動詞或形容詞、關係的副詞等，偶爾仍會出現些微誤用。",
        "即使在描述很簡單的情境時，有時也會把句子說得過於複雜。",
        "在使用非常高級的慣用表達（如成語或諺語等）時，仍可能有些不確定。",
        "句子很長時，偶爾會出現語句不通順或前後不一致的錯誤。",
        "在非常正式的寫作或發表中，表達上仍有可以再加強修飾的空間。",
        "在時間壓力很大時，可能認為「這樣就夠了」而略微放棄部分細節準確度。",
        "各種細微而複雜的句型與結構若要始終保持完全一致的高準確度，仍需要更進一步的訓練。"
      ]
    }
  }
}