{
  "english": {
    "vocabulary": [
      {
        "level": "1",
        "description": "Has the ability to use common, introductory words and phrases to express oneself."
      },
      {
        "level": "1.5",
        "description": "Has a growing vocabulary of daily, common words and expressions that can be used in everyday situations."
      },
      {
        "level": "2",
        "description": "Has fundamental vocabulary of individual terms and phrases about specific, everyday situations."
      },
      {
        "level": "2.5",
        "description": "Has a continuously expanding basic set of words and phrases for commonplace, everyday situations."
      },
      {
        "level": "3",
        "description": "Possesses rudimentary vocabulary terms and phrases pertaining to personal information and fundamental practical needs."
      },
      {
        "level": "3.5",
        "description": "Displays a foundational vocabulary for addressing personal details and basic needs that is working towards having sufficient knowledge in these aspects."
      },
      {
        "level": "4",
        "description": "Demonstrates satisfactory vocabulary with fundamental communication and essential survival situations."
      },
      {
        "level": "4.5",
        "description": "Adequately addresses fundamental communication and survival needs while building the vocabulary needed for common, intermediate interactions about familiar subjects."
      },
      {
        "level": "5",
        "description": "Possesses solid vocabulary for handling regular, everyday interactions about common subjects."
      },
      {
        "level": "5.5",
        "description": "Has adequate vocabulary for dealing with familiar and routine subjects, with ongoing vocabulary development for a broader range of daily life topics."
      },
      {
        "level": "6",
        "description": "Shows a satisfactory vocabulary foundation to communicate about topics such as personal interests, career, travel, and recent news with some rephrasing needed."
      },
      {
        "level": "6.5",
        "description": "Is capable of handling regular, familiar interactions and topics with the aim of achieving greater competency."
      },
      {
        "level": "7",
        "description": "Exhibits functional, practical vocabulary and can navigate known conversation topics and commonplace events with relative ease."
      },
      {
        "level": "7.5",
        "description": "Has developed a broad vocabulary for familiar topics and regular situations, aiming towards using advanced and/or natural language in their respective professional field and other specialized fields of interest."
      },
      {
        "level": "8",
        "description": "Uses much of the specific and natural language across a variety of contexts and topics, especially within subject matter where a level of expertise within the domain has been sought after."
      },
      {
        "level": "8.5",
        "description": "Demonstrates the ability to use much of the specific and natural language across areas within their field and interests. Is working on acquiring proficiency in using technical and natural terminology in other unfamiliar subjects, specialized and broad."
      },
      {
        "level": "9",
        "description": "Maintains a strong grasp of key technical terms and natural language for both specialized and general, everyday subjects."
      },
      {
        "level": "9.5",
        "description": "Currently improving upon using less descriptive language and evasion techniques and more technical and natural language when using vocabulary across all subject matter."
      },
      {
        "level": "10",
        "description": "Exhibits a rich lexicon that enables speaking and discussing any topic smoothly with ease; little to no issues with deriving, recalling, and utilizing language with precision and accuracy."
      },
      {
        "level": "10+",
        "description": "Has a sophisticated lexical range and verbal arsenal that allows speaking of general and complex subjects with little to no difficulty, with aspirations of speaking identically to that of a native speaker in terms of modern natural language, colloquial expressions, and slang."
      }
    ],
    "grammar": [
      { "level": "1", "description": "Grasps basic question and subject-verb-object patterns." },
      {
        "level": "1.5",
        "description": "Shows the ability to correctly arrange words in simple, short sentences and is working towards understanding and using an increasing range of grammar structures."
      },
      {
        "level": "2",
        "description": "Understands a narrow range of familiar, introductory grammar rules and fundamental sentence patterns."
      },
      {
        "level": "2.5",
        "description": "Is progressing towards increasing the range of learnt grammar structures and sentence patterns in short, clear sentences."
      },
      {
        "level": "3",
        "description": "Demonstrates control of a limited amount of familiar basic grammar rules and sentence structure."
      },
      {
        "level": "3.5",
        "description": "Is moving towards acquiring higher accuracy towards learnt grammar and sentence patterns while maintaining coherence. Has increased comfortability in describing actions and states."
      },
      {
        "level": "4",
        "description": "Can further enhance accuracy in introductory grammar and sentence structures. While elementary mistakes are present, frequent confusion or misunderstanding is rare."
      },
      {
        "level": "4.5",
        "description": "Is working on continuous improvement of grammar and sentence pattern correctness for consistent coherence. Is starting to use more complex forms."
      },
      {
        "level": "5",
        "description": "Has made progress in introductory grammar and sentence structure, with room to further refine accuracy. It is uncommon to have significant clarity and coherence issues for fundamental English mistakes."
      },
      {
        "level": "5.5",
        "description": "Has increased accuracy of basic grammar and sentence structure usage with further accuracy improvement needed. Is becoming more experienced in using common, routine grammar and sentence patterns."
      },
      {
        "level": "6",
        "description": "Effectively applies familiar routine and sentence pattern sets in expected scenarios while being fairly accurate. Is in the process of refining their understanding of intermediate grammar concepts."
      },
      {
        "level": "6.5",
        "description": "Is moving towards consistently expressing thoughts clearly in well-known contexts more accurately while limiting native language influences. Is beginning to develop a good grasp of intermediate-level grammar."
      },
      {
        "level": "7",
        "description": "Expresses ideas clearly in known situations despite some recognition of native language influences. Clarity is maintained in spite of occasional mistakes."
      },
      {
        "level": "7.5",
        "description": "Is handling basic, routine situations well and is starting to use more advanced grammar and sentence forms while continuing to build upon flexibility and accuracy in using complex structures."
      },
      {
        "level": "8",
        "description": "Handles basic, routine structures confidently and is in the process of incorporating more advanced grammar and sentence forms with precision and versatility."
      },
      {
        "level": "8.5",
        "description": "Is improving upon understanding and execution of more advanced grammar concepts. Is able to self-correct and has a good control of intermediate and advanced grammar concepts and sentence patterns."
      },
      {
        "level": "9",
        "description": "Has control over grammar and sentence structures with minor inconsistencies being infrequent. Consistent self-correction occurs when these inconsistencies are present."
      },
      {
        "level": "9.5",
        "description": "Commands a wide range of natural and advanced grammatical structures in which self-correction is possible for inconsequential mistakes. Is in the process of achieving near-perfect accuracy."
      },
      {
        "level": "10",
        "description": "Demonstrates grammar fluency of a wide range of grammar structures with accuracy and relevance by recognizing nuances and subtle distinctions between contexts, tones, and formalities."
      },
      {
        "level": "10+",
        "description": "Is demonstrating complete control of all aspects of grammar. Is in the process of mastery of being versatile and adaptable with grammar in different contexts, tones, and formalities with precision and clarity."
      }
    ],
    "pronunciation": [
      {
        "level": "1",
        "description": "Exhibits an accent with distinct native language influences on the targeted language, making comprehension challenging at times."
      },
      {
        "level": "1.5",
        "description": "Pronunciation includes a noticeable accent and requires enunciation of key phonetic sounds. Is working towards clear articulation of basic phonetic sounds and general words in short form."
      },
      {
        "level": "2",
        "description": "Pronunciation of a small set of familiar words are recognized with some effort by native speakers accustomed to various accents. Basic stress patterns and enunciation are becoming more apparent."
      },
      {
        "level": "2.5",
        "description": "Is understanding and increasing the accuracy of short phonetic combinations. Intonation is beginning to become apparent when speaking. Able to be understood by native speakers with experience with the speaker, but effort is required at times."
      },
      {
        "level": "3",
        "description": "Increased occasions of using the appropriate simple and common phonetic sounds. The learner is able to use intonation more often for common, routine words and phrases. Effort is needed by native speakers to fully understand what has been said at times."
      },
      {
        "level": "3.5",
        "description": "Pronunciation has improved to the point of being understood despite a noticeable accent. Being asked to repeat spoken words occurs often but has been steadily decreasing."
      },
      {
        "level": "4",
        "description": "Pronunciation typically has enough phonetic and intonational correctness to be understood in spite of a foreign accent being apparent. Repetition may be asked at times because of more advanced phonetic sounds, stress, and intonation of unfamiliar words."
      },
      {
        "level": "4.5",
        "description": "Is understanding and practicing the principles of basic word stress, intonation, and rhythm to better communicate familiar information with a higher frequency of intelligibility."
      },
      {
        "level": "5",
        "description": "Is beginning to grasp the use of chunking and pausing within their speech to better increase understanding. Basic foundational pronunciation aspects are being improved upon such that being asked to repeat because of those aspects are decreasing."
      },
      {
        "level": "5.5",
        "description": "Is in the process of becoming generally intelligible, where basic to intermediate level phonics, intonation, and stress are more evident despite native language influences."
      },
      {
        "level": "6",
        "description": "Native language influences on pronunciation, although apparent, have generally decreased. Is having a stronger grasp of using speaking rhythm: pausing, chunking, word, and sentence stress."
      },
      {
        "level": "6.5",
        "description": "Is in the process of further improving pronunciation accuracy of learnt concepts to decrease the situations of misunderstandings or confusion."
      },
      {
        "level": "7",
        "description": "Accuracy of familiar and common pronunciations have increased through a better understanding of introductory to intermediate pronunciation techniques such as stress, intonation, phonics, chunking, and pausing."
      },
      {
        "level": "7.5",
        "description": "Is achieving a better comprehension and execution of pronunciation concepts such as stress, intonation, phonics, chunking, and pausing while decreasing native language impact on intelligibility."
      },
      {
        "level": "8",
        "description": "Intonation and stress are generally used well, though the accent reflects native language influences, with minimal impact on clarity."
      },
      {
        "level": "8.5",
        "description": "Is having a deeper understanding of connected speech and linking to have better spoken word flow. Is focusing on continuous improvement of common and uncommon intonation and stress."
      },
      {
        "level": "9",
        "description": "Uses intonation and stress effectively. Pronunciation remains clear and is articulated well. Accent has little or no effect on clarity."
      },
      {
        "level": "9.5",
        "description": "Demonstrates the ability to use most pronunciation concepts effortlessly with little inaccuracies. Advanced forms of pronunciation such as vocal projection are being practiced and improved upon."
      },
      {
        "level": "10",
        "description": "Maintains complete control over phonological concepts to maintain clear conversation. Most sounds are articulated with high accuracy and precision."
      },
      {
        "level": "10+",
        "description": "Is aspiring to have complete mastery as to that of a native speaker. Advanced forms of pronunciation such as vocal projection and tone are being perfected."
      }
    ],
    "listening": [
      {
        "level": "1",
        "description": "Can identify basic sounds and simple words that are a part of everyday language, provided that it is spoken slowly and enunciated clearly."
      },
      {
        "level": "1.5",
        "description": "Can determine common, familiar words when spoken slowly and clearly in everyday situations. Is working on picking out specific details on familiar topics."
      },
      {
        "level": "2",
        "description": "Able to identify common intonation patterns and simple stress in words. Uses context and visual clues to grasp basic meanings and clear phrases, provided that it is delivered in a slow and clear way."
      },
      {
        "level": "2.5",
        "description": "Is in the process of keeping up with speech that is slow and well-articulated, with speaking pauses to process the information."
      },
      {
        "level": "3",
        "description": "Is able to understand slow and clear speech that provides time for comprehension. Is beginning to distinguish clear stress patterns, simple intonation, and focus on context to understand."
      },
      {
        "level": "3.5",
        "description": "Is developing an understanding of phrases and expressions related to important speaking situations, such as personal and familial information, provided that speech is articulated in a clear and slow way."
      },
      {
        "level": "4",
        "description": "Has a better understanding of intonation and stress such that essential phrases related to immediate concerns are more easily comprehended."
      },
      {
        "level": "4.5",
        "description": "Is experimenting with segmenting spoken words into more understandable segments, provided that speech is clear and slow."
      },
      {
        "level": "5",
        "description": "Can grasp sufficient details to meet specific needs when speech is clear and slow."
      },
      {
        "level": "5.5",
        "description": "Is familiarizing oneself with chunking to comprehend main points when topics are spoken at a moderately slow speed. Is beginning to understand the key points of common, daily life topics such as work, school, leisure, and small talk."
      },
      {
        "level": "6",
        "description": "Comprehends the key points of common, routine matters related to career, schooling, interests, and small talk."
      },
      {
        "level": "6.5",
        "description": "Is becoming able to listen at a moderate speed to understand daily life and general work-related dialogue. Is starting to become accustomed to listening to unfamiliar accents."
      },
      {
        "level": "7",
        "description": "Has the ability to comprehend general work and daily life-related topics. Is becoming more adept at identifying main points and nuances within the speech. Able to listen to a native speaker at a moderately fast speed."
      },
      {
        "level": "7.5",
        "description": "Has made progress in understanding detailed information and complex arguments in various contexts. Is improving upon using context and chunking to follow discussions with diverse accents and faster speech."
      },
      {
        "level": "8",
        "description": "Grasps key points of complex discussions on a variety of topics, including technical content in their area of expertise when spoken to during regular conversation. Is able to listen to a native speaker at a fast speed."
      },
      {
        "level": "8.5",
        "description": "Is moving towards understanding the main ideas in detailed speech on both common and specialized topics. Is progressing towards comprehension of broader discussions in various contexts."
      },
      {
        "level": "9",
        "description": "Demonstrated the ability to comprehend spoken communication on a variety of topics that are commonly or uncommonly encountered in everyday, academic, or work situations. Has the ability to listen to a native speaker at near-native speed."
      },
      {
        "level": "9.5",
        "description": "Is in the process of grasping lengthy spoken content across various subjects by utilizing advanced listening skills and contextual clues to discern main points and subtle details. Is becoming accustomed to listening at native speed, of a variety of native accents, with the occasional need for clarification."
      },
      {
        "level": "10",
        "description": "Has the ability to comprehend spoken language at native speed. Can better interpret the main points and nuances of complex and detailed matters outside of primary knowledge areas. Occasional clarification is still needed at times, particularly when accents differ greatly from the learner’s listening experiences."
      },
      {
        "level": "10+",
        "description": "Is becoming more able to follow and interpret lengthy discourse beyond familiar areas. Is progressing towards mastery of advanced listening techniques to grasp nuanced arguments, intricate details, and varied accents with ease."
      }
    ],
    "conversation": [
      {
        "level": "1",
        "description": "Asks and answers questions about personal details and daily activities, using brief, short phrases and supportive non-verbal gestures."
      },
      {
        "level": "1.5",
        "description": "Accustoming oneself to exchanges in basic, short interactions. Is reliant on repetition, slower speech, and rephrasing to maintain understanding."
      },
      {
        "level": "2",
        "description": "Engages in basic interaction, with communication relying heavily on repetition, slower speech, and restating information. Is able to use simple speaking structures to express basic needs and preferences."
      },
      {
        "level": "2.5",
        "description": "Is able to construct basic sentences to convey information. Is working on providing more detailed answers and formulating appropriate, introductory questions."
      },
      {
        "level": "3",
        "description": "Handles straightforward, common conversations with an emphasis on enhancing communication by practicing repetition and adjusting speech rate for better understanding."
      },
      {
        "level": "3.5",
        "description": "Is progressing towards better participation in straightforward exchanges while handling simple speaking tasks and direct information sharing in familiar situations."
      },
      {
        "level": "4",
        "description": "Manages basic tasks and exchanges related to routine work and leisure. Handles very brief social interactions effectively."
      },
      {
        "level": "4.5",
        "description": "Is linking ideas in longer sentences and relating events in a sequence of basic descriptions. Is starting to show confidence in starting and having conversations on familiar topics."
      },
      {
        "level": "5",
        "description": "Engages comfortably in structured interactions and brief conversations with some assistance when appropriate. Has the ability to share thoughts on familiar topics in everyday settings."
      },
      {
        "level": "5.5",
        "description": "Is practicing navigating conversations on familiar topics with ease by sharing personal information and daily matters in more structured sentences, even without prior preparation."
      },
      {
        "level": "6",
        "description": "Can actively join spontaneous conversations on familiar topics, share personal insights, and discuss everyday matters. Able to ask for clarity, clarify, and paraphrase to ensure understanding."
      },
      {
        "level": "6.5",
        "description": "Is starting to be more comfortable speaking about both regular and less familiar personal and professional subject matter, including confirming and exchanging information in various contexts."
      },
      {
        "level": "7",
        "description": "Communicates relatively smoothly on a range of familiar and less common topics related to personal and professional areas while managing conversations with some ease and verifying details when needed."
      },
      {
        "level": "7.5",
        "description": "Is moving towards sustaining longer, more complex conversations on a wide range of topics. Is working on effective presentation and defense of viewpoints with appropriate language structures."
      },
      {
        "level": "8",
        "description": "Contributes in conversation with a comfortable flow that ensures natural exchanges and meaningful, sustained interactions with speakers of the targeted language without added effort."
      },
      {
        "level": "8.5",
        "description": "Participates in discussion with fluency and spontaneity while adjusting to different levels of formality when needed. Is becoming more practiced in telling detailed stories, explaining processes clearly, and convincing others with well-structured arguments and reasoning."
      },
      {
        "level": "9",
        "description": "Expresses thoughts and ideas freely and accurately, adapting the level of formality as needed while sustaining linguistic accuracy."
      },
      {
        "level": "9.5",
        "description": "Is approaching fluent and natural communication with a strong grasp of language structure and formality. Is progressing towards being adept at expressing subtle distinctions, handling abstract and complex topics, and using advanced speaking techniques."
      },
      {
        "level": "10",
        "description": "Handles diverse topics with confidence, using language flexibly and accurately to convey ideas without effort, adjusting tone and formality as needed."
      },
      {
        "level": "10+",
        "description": "Is progressing towards fluency in spontaneous conversation on any topic with ease. Is at the level where continuous learning and incorporation of cultural references and idioms naturally is needed. Is becoming more practiced in handling abstract, complex arguments with precision and depth."
      }
    ]
  },
  "chinese": {
    "vocabulary": [
      { "level": "0", "description": "無學習華語經驗。" },
      { "level": "0.5", "description": "大致知道些許常見入門單詞，例如:你好、謝謝。" },
      { "level": "1", "description": "能掌握自我介紹相關的入門單詞和短句。" },
      {
        "level": "1.5",
        "description": "能辨別出日常生活中與個人切身相關的高頻詞彙，並逐漸能在日常情境中使用。"
      },
      {
        "level": "2",
        "description": "能理解日常生活中所使用的高頻詞彙或短語，並能應對特定的日常情境。"
      },
      { "level": "2.5", "description": "日常常見的基本單詞和短句逐漸累積中。" },
      { "level": "3", "description": "能理解與個人切身相關的單詞，並能簡單地表達自身需求。" },
      {
        "level": "3.5",
        "description": "能掌握部分的單詞來表達基本的溝通需求或應對簡單的生存需求，並且逐漸累積詞彙量中。"
      },
      { "level": "4", "description": "具備足夠的單字量來表達基本的溝通需求及應對簡單的生存需求。" },
      {
        "level": "4.5",
        "description": "能夠充分解決基本溝通和生存需求，並逐漸累積中級交流所需的詞彙。"
      },
      { "level": "5", "description": "擁有充足的詞彙量來應對常規的日常交流和常見話題。" },
      {
        "level": "5.5",
        "description": "擁有足夠的詞彙量來應對熟悉和日常的主題，並持續擴展更多的詞彙來處理更廣泛的日常生活話題。"
      },
      {
        "level": "6",
        "description": "對日常生活中切身相關的主題（如：個人興趣、職業、旅行和時事)，有足夠的字彙量表達自己的想法，但仍可能有部分需要改變敘述方式。"
      },
      {
        "level": "6.5",
        "description": "能夠處理常規、熟悉的交流和話題，目標是往更高的語言程度邁進。"
      },
      { "level": "7", "description": "展現實用詞彙，能夠較為輕鬆地應對熟悉的對話主題和日常情境。" },
      {
        "level": "7.5",
        "description": "已具備豐富詞彙，能夠應對熟悉的話題和日常情境，並逐步朝向在專業領域或個人興趣領域運用高階且自然的語言邁進。"
      },
      {
        "level": "8",
        "description": "在各種情境和話題中能使用許多具體且自然的單詞，特別是能理解自己專業領域中所使用的詞彙。"
      },
      {
        "level": "8.5",
        "description": "能夠在自身領域和興趣範圍內運用大量具體且自然的語言能力，並且積極提升在陌生領域中使用專業術語和自然表達的熟練度。"
      },
      { "level": "9", "description": "在專業與日常主題中，能夠熟練掌握專業術語並自然運用。" },
      {
        "level": "9.5",
        "description": "能夠避免使用含糊不清的表達或替代說法，更加熟練地運用專業且自然的詞彙。"
      },
      {
        "level": "10",
        "description": "展現出豐富的詞彙量，能夠流暢討論任何話題，並精準運用語言，幾乎不會出現障礙。"
      },
      {
        "level": "10+",
        "description": "擁有不同領域的詞彙量，能夠輕鬆討論一般話題與複雜主題，並致力於在現代詞彙、口語表達及俚語運用上達到母語者水平。"
      }
    ],
    "grammar": [
      { "level": "0", "description": "無學習華語經驗。" },
      { "level": "0.5", "description": "大致知道些許常見入門短句，例如:我是(國家)人、我喜歡...。" },
      { "level": "1", "description": "掌握基本的疑問句和主謂賓結構。" },
      {
        "level": "1.5",
        "description": "能夠正確排列簡單短句中的單詞，並逐步理解與運用越來越多的語法結構。"
      },
      { "level": "2", "description": "能理解常見入門語法規則與基本句型。" },
      {
        "level": "2.5",
        "description": "語法結構與句型的掌握正在進步，學習範圍不斷擴展，並能在簡短且清晰的句子中加以運用。"
      },
      { "level": "3", "description": "能夠熟練運用範圍有限的基本語法與句子結構。" },
      {
        "level": "3.5",
        "description": "能夠越來越準確地運用所學的語法與句型，對描述動作與狀態的表達變得更加順暢。"
      },
      {
        "level": "4",
        "description": "能夠正確運用入門級語法和句型，雖仍會出現基本錯誤，但大致能避免混淆或誤解。"
      },
      {
        "level": "4.5",
        "description": "能夠更準確地運用語法與句型，並開始使用較為複雜的語法結構。"
      },
      {
        "level": "5",
        "description": "在初級語法與句子結構上有所進步，但仍有提升準確性的空間。基本錯誤不至於嚴重影響句子的連貫性。"
      },
      {
        "level": "5.5",
        "description": "基本語法與句子結構的準確度有所提升，但仍需進一步精進，並逐漸熟悉日常語法與句型的運用。"
      },
      {
        "level": "6",
        "description": "能夠熟練運用常見的固定表達與句型，且整體較為準確，並正在加深對中級語法的理解。"
      },
      {
        "level": "6.5",
        "description": "在熟悉的情境中，能夠較穩定且更精確地表達自身想法，同時減少母語影響。此外，已開始扎實理解中級語法。"
      },
      {
        "level": "7",
        "description": "在熟悉的情境中，雖然仍受到一些母語影響，但能清楚表達想法。偶爾出現錯誤，但仍易於理解。"
      },
      {
        "level": "7.5",
        "description": "能夠熟練應對日常情境，並開始運用更高階的語法與句型。此外，對於較複雜的句構能夠更加靈活且準確地運用。"
      },
      {
        "level": "8",
        "description": "能夠自信地運用基本的固定表達，並逐步準確且靈活地融入更高階的語法與句型。"
      },
      {
        "level": "8.5",
        "description": "能夠理解並運用更高階的語法，並熟練掌握中級至高級語法與句型，能夠有意識地修正錯誤。"
      },
      {
        "level": "9",
        "description": "能夠充分掌握語法與句子結構，偶爾出現細微錯誤，但能夠穩定地自行修正。"
      },
      {
        "level": "9.5",
        "description": "能夠靈活運用多樣且自然的表達方式與高階語法結構，並能自行修正細微錯誤，致力於達到近乎完美的準確度。"
      },
      {
        "level": "10",
        "description": "能夠流暢運用複雜的語法結構，並理解語境、語調與形式的細微差異，且能夠恰當地加以運用。"
      },
      {
        "level": "10+",
        "description": "能夠掌控高級語法，並精確且熟練地根據不同語境、語調與表達形式加以運用，逐步達到母語者平。"
      }
    ],
    "pronunciation": [
      { "level": "0", "description": "無學習華語經驗。" },
      { "level": "0.5", "description": "曾學習過拼音但尚未穩定掌握拼音組合與聲調。" },
      { "level": "1", "description": "發音與聲調深受母語影響，經常導致理解困難。" },
      {
        "level": "1.5",
        "description": "發音帶有明顯的口音，仍需練習以掌握正確發音。同時，正在專注於拼音組合及穩定聲調的練習。"
      },
      {
        "level": "2",
        "description": "熟悉的部分單詞能夠被習慣各種口音的母語者大致理解。此外，基本的聲調與發音逐漸變得更加準確與穩定。"
      },
      {
        "level": "2.5",
        "description": "能夠掌握拼音，並逐漸提升發音與聲調穩定度。表達開始變得清晰，對母語者而言，大致能夠理解，但有時仍需重複。"
      },
      {
        "level": "3",
        "description": "能夠更準確地發音，日常單詞與短語的表達變得更加清晰，但母語者在理解時可能仍會遇到些許困難。"
      },
      {
        "level": "3.5",
        "description": "發音已經有所進步，即使有明顯的口音，也能被理解。要求重複的情況變得更少。"
      },
      {
        "level": "4",
        "description": "發音大致準確與穩定，即使帶有外國口音，大多數情況下仍能被理解。然而，對於不熟悉的陌生單詞，可能仍會被要求重複。"
      },
      {
        "level": "4.5",
        "description": "正在理解並練習基本的語調與斷句，能夠更清楚地傳達熟悉的資訊，並提升口語表達的理解度。"
      },
      {
        "level": "5",
        "description": "開始掌握斷句與停頓，使表達更清晰易懂。基本發音能力亦有所提升，被要求重複的情況逐漸減少。"
      },
      {
        "level": "5.5",
        "description": "正處於可理解度逐步提升的階段，基礎至中級程度的聲調組合、語調變得更加清晰，但仍受到母語影響。"
      },
      {
        "level": "6",
        "description": "儘管母語對發音的影響仍然明顯，但已有所減少。對發音的掌握更為穩定，包括能意識停頓、分段位置。"
      },
      {
        "level": "6.5",
        "description": "發音正在進一步提升與穩定，從而減少對母語者的誤解或混淆情況。"
      },
      {
        "level": "7",
        "description": "對聲調掌握、語調、停頓等入門至中級的發音技巧有更深入的理解，熟悉的單詞與常見發音的準確性有所提升。」"
      },
      {
        "level": "7.5",
        "description": "對聲調掌握、語調、停頓等入門至中級的發音技巧有更好的掌握。同時，母語影響減少，使發音更易於理解。」"
      },
      {
        "level": "8",
        "description": "語調和重音通常使用得當，儘管口音反映了母語影響，但對清晰度的影響最小。"
      },
      {
        "level": "8.5",
        "description": "發音大致良好，口音仍受到母語影響，但整體表達準確，幾乎不會造成溝通困難。"
      },
      {
        "level": "9",
        "description": "能夠掌握語調，發音清晰且準確。即使仍帶有母語口音，但幾乎不影響理解。"
      },
      {
        "level": "9.5",
        "description": "能夠自然掌握大部分的發音，幾乎沒有錯誤。逐漸有高級學習者的表現。"
      },
      { "level": "10", "description": "完全掌握發音，對話理解度清晰準確。" },
      { "level": "10+", "description": "完全掌握發音，致力於像母語者一樣的語調與表現。" }
    ],

    "listening": [
      { "level": "0", "description": "無學習華語經驗。" },
      { "level": "0.5", "description": "能大致理解入門單詞和短句。" },
      { "level": "1", "description": "在語速較慢且發音清晰的前提下，能夠辨識入門單詞與短句。" },
      {
        "level": "1.5",
        "description": "在日常情境中，如果對方說話速度較慢且發音清晰，能夠聽懂熟悉的單詞。正在練習理解熟悉話題的細節資訊。"
      },
      {
        "level": "2",
        "description": "能區分聲調差異及常見語境下的語調，如果說話者速度較慢且發音清晰，能夠利用上下文和視覺線索來掌握基本含義。"
      },
      {
        "level": "2.5",
        "description": "能區分聲調差異及常見語境下的語調，如果說話者速度較慢且發音清晰，能夠利用上下文和視覺線索來掌握基本含義。"
      },
      {
        "level": "3",
        "description": "能理解語速較慢且清晰的資訊，並能有足夠的時間來理解，並專注於利用語境來理解。"
      },
      {
        "level": "3.5",
        "description": "當發音清晰且語速較慢時，能夠理解個人或家庭相關資訊等重要對話情境中使用的短句和表達。"
      },
      {
        "level": "4",
        "description": "對語調和聲調的掌握逐漸穩定，日常生活中常用的重要表達變得更容易聽懂。"
      },
      {
        "level": "4.5",
        "description": "當說話者語速較慢時，為了更能理解資訊，正在嘗試把資訊分割成更容易理解的單詞或短句。"
      },
      { "level": "5", "description": "能夠聽懂清晰且語速較慢的內容，並充分掌握所需的細節資訊。" },
      {
        "level": "5.5",
        "description": "正在熟悉將資訊區分成慣用語塊來理解重點，在說話者以中等速度說話的前提下，能理解工作、學校、休閒和日常對話。"
      },
      {
        "level": "6",
        "description": "能夠理解與工作、學校、興趣以及日常生活等常見主題的重要內容。"
      },
      {
        "level": "6.5",
        "description": "能夠理解日常生活和工作相關的對話，即使語速適中，也能掌握。並適應不同的口音。"
      },
      {
        "level": "7",
        "description": "具備理解與工作或日常生活相關話題的能力。能夠更準確地辨識對話重點和語氣差異，並且能適應母語者的語速。"
      },
      {
        "level": "7.5",
        "description": "能夠理解各種情境中的詳細資訊和較複雜的內容。面對不同的口音或較快的語速，也能透過語境和上下文理解對話。"
      },
      {
        "level": "8",
        "description": "能夠理解各種主題和複雜內容。在一般語速下，能理解與自身專業領域相關的內容。此外，還能理解母語者以較快語速進行的對話。"
      },
      {
        "level": "8.5",
        "description": "不僅能理解日常話題，還能掌握專業領域的主要內容。對各種情境下的對話理解能力正在進一步提升。"
      },
      {
        "level": "9",
        "description": "除了日常和工作相關話題外，對不太熟悉的話題也能理解。能夠理解以母語者語速進行的對話。"
      },
      {
        "level": "9.5",
        "description": "能夠從各種話題的較長對話中掌握細節和重點，具備利用上下文掌握聽力的能力。已經習慣母語者的語速和各種口音，但偶爾仍需確認某些內容。"
      },
      {
        "level": "10",
        "description": "能夠理解與母語者相同語速的對話，並準確掌握非專業領域中複雜且細節的內容，包括重點與語感。不過，當遇到與平時熟悉的口音差異較大時，偶爾仍可能需要確認某些內容。"
      },
      {
        "level": "10+",
        "description": "即使是不熟悉的領域，也能理解較長的對話。掌握高級內容，能輕鬆理解複雜的討論語細節和適應不同的口音。"
      }
    ],
    "conversation": [
      { "level": "0", "description": "無學習華語經驗。" },
      { "level": "0.5", "description": "能對入門單詞和短句反應但未能進行溝通交流。" },
      {
        "level": "1",
        "description": "能夠用簡單的短語表達自己的日常習慣或行為，並以手勢輔助來提出問題或回答。"
      },
      {
        "level": "1.5",
        "description": "逐漸熟悉基本的簡短對話，但在理解上仍需依賴重複、放慢語速或換句話說等方式。"
      },
      {
        "level": "2",
        "description": "能夠進行基本的溝通，但需要對方放慢語速或重複說明才能理解。能夠使用簡單的句子結構來表達基本的日常內容或自己的喜好。"
      },
      {
        "level": "2.5",
        "description": "能夠以簡單的句式來傳達基本資訊，並正在提升以更詳細的回答和提出正確問題的能力。"
      },
      {
        "level": "3",
        "description": "能夠進行簡單且一般性的對話，並透過調整語速來提升溝通的順暢度，以加深理解。"
      },
      {
        "level": "3.5",
        "description": "能夠進行簡單的對話任務和直接的資訊交流，並正在提升對話的流暢度。"
      },
      {
        "level": "4",
        "description": "能夠進行與工作或興趣相關的基本交流，並且能夠順利進行簡單且簡短的對話。"
      },
      {
        "level": "4.5",
        "description": "能夠使用較長的句子連貫內容，依序描述事件的發展。對於熟悉的話題，能夠自信地開啟對話並持續進行交流。"
      },
      {
        "level": "5",
        "description": "能夠順利參與簡單的對話，並在需要時適時尋求幫助。在日常情境中，能夠針對熟悉的話題表達自己的想法。"
      },
      {
        "level": "5.5",
        "description": "即使沒有事先準備，也能有條理地談論自己的事情和日常生活中的事件。對於熟悉的話題，能夠輕鬆地進行對話。"
      },
      {
        "level": "6",
        "description": "在熟悉的話題上能夠積極參與對話，分享自己的想法並談論日常事務。此外，能夠透過提問、解釋或換句話說來加深理解。"
      },
      {
        "level": "6.5",
        "description": "能夠在各種情境下談論日常事務以及較不熟悉的個人或職場話題，並透過確認和交換資訊來提高對話的流暢度。"
      },
      {
        "level": "7",
        "description": "在個人和職場領域中，能夠相對流暢地討論稍具挑戰性的話題，並在需要時進一步確認細節。"
      },
      {
        "level": "7.5",
        "description": "能夠在各種話題上進行較長且複雜的對話，並練習以適當的詞彙表達自己的觀點，以及對他人的意見進行恰當的協商或反論。"
      },
      {
        "level": "8",
        "description": "不需要特別費力，也能自然流暢地進行對話，並與對方進行有意義的交流。"
      },
      {
        "level": "8.5",
        "description": "能夠流暢且自然地進行對話，並根據需要調整正式與口語程度。能夠詳細闡述內容、清楚地說明，並說服他人。"
      },
      {
        "level": "9",
        "description": "能夠自由且精確地表達自己的想法和觀點，並且能夠根據需要調整正式與口語的表達方式。"
      },
      {
        "level": "9.5",
        "description": "能夠清楚掌握語言的結構和正式程度，逐漸接近流暢且自然的溝通能力。能夠表達細微語氣差異，處理抽象且複雜的話題，並運用高級的表達方式。"
      },
      {
        "level": "10",
        "description": "能自信地應對各種話題，靈活且精確地運用語言，自然地表達自己的想法。能夠根據需求調整語氣與正式程度。"
      },
      {
        "level": "10+",
        "description": "能夠即興且自然地談論任何主題，並且能靈活運用文化背景與慣用表達。此外，也在持續練習深入理解並精確表達抽象且複雜的議題。"
      }
    ]
  },
  "korean": {
    "vocabulary": [
      { "level": "0", "description": "한국어 학습 경험이 없습니다." },
      {
        "level": "0.5",
        "description": "\"안녕하세요\", \"감사합니다\" 기본적인 인사말은 대체로 이해하고 있습니다."
      },
      {
        "level": "1",
        "description": "자기 자신을 소개하기 위한 아주 기본적인 단어나 아주 단순한 표현을 알고 있습니다."
      },
      {
        "level": "1.5",
        "description": "일상적으로 사용하는 일반적인 단어와 표현을 점점 더 익혀 가고 있습니다."
      },
      {
        "level": "2",
        "description": "일상적으로 자주 사용하는 기본적인 어휘를 이해하고 있습니다."
      },
      {
        "level": "2.5",
        "description": "일상적으로 자주 사용하는 기본적인 말이나 문구의 어휘가 점점 늘어나고 있습니다."
      },
      {
        "level": "3",
        "description": "개인 정보에 관한 어휘나 실용적인 기초 단어나 표현을 이해하고 있습니다."
      },
      {
        "level": "3.5",
        "description": "개인정보나 일상적인 사항에 관한 기본적인 어휘를 갖추고 있으며, 이를 충분히 이해하기 위해 노력하고 있습니다."
      },
      {
        "level": "4",
        "description": "기본적인 의사소통과 생존에 필요한 상황에 대응할 수 있는 충분한 어휘를 갖추고 있습니다."
      },
      {
        "level": "4.5",
        "description": "친숙한 주제에 대해 중급 수준의 의사소통을 할 수 있는 어휘를 익히며, 기본적인 의사소통과 생존에 필요한 언어를 적절하게 사용할 수 있습니다."
      },
      {
        "level": "5",
        "description": "일상적인 대화에서 사용되는 어휘나 공통된 주제에 대한 어휘를 명확히 이해하고 있습니다."
      },
      {
        "level": "5.5",
        "description": "일상적인 주제에 대해 이해할 수 있는 충분한 어휘력을 갖추고 있으며, 더 다양한 일상 생활의 주제를 다루기 위해 어휘를 지속적으로 늘려가고 있습니다."
      },
      {
        "level": "6",
        "description": "본인의 관심사, 직업, 여행, 최근 뉴스 등의 주제에 대해 이야기할 수 있을 만큼 충분한 어휘력을 갖추고 있으나, 일부 표현에서는 다른 말로 바꿔야 할 때가 있습니다."
      },
      {
        "level": "6.5",
        "description": "일상적이고 익숙한 대화나 주제에 능숙하게 대응할 수 있으며, 더 높은 수준의 언어 실력을 달성하는 것을 목표로 하고 있습니다."
      },
      {
        "level": "7",
        "description": "실용적인 어휘를 갖추고 있어 익숙한 주제나 일상적인 사건에 비교적 원활하게 대응할 수 있습니다."
      },
      {
        "level": "7.5",
        "description": "익숙한 주제나 일상적인 상황에서 폭넓은 어휘를 구사할 수 있으며, 전문 분야나 관심 있는 분야에서 더 고급스럽고 자연스러운 표현을 목표로 하고 있습니다."
      },
      {
        "level": "8",
        "description": "다양한 상황과 주제에서 구체적이고 자연스러운 언어를 사용할 수 있으며, 특히 이미 전문 지식을 갖춘 분야에서는 더욱 정확하게 표현할 수 있습니다."
      },
      {
        "level": "8.5",
        "description": "자신의 전문 분야나 관심 분야에서 많은 전문 용어를 사용할 수 있으며, 다른 낯선 분야에서도 새로운 용어나 표현을 습득하려고 노력하고 있습니다."
      },
      {
        "level": "9",
        "description": "전문적인 주제나 일상적인 대화에서 전문 용어를 잘 이해하고 있고 자연스러운 표현을 높은 수준으로 구사할 수 있습니다."
      },
      {
        "level": "9.5",
        "description": "모든 주제에서 더 자연스러운 언어를 사용하기 위해 모호한 표현이나 우회적인 표현을 줄이고 보다 전문적이고 자연스러운 어휘를 활용할 수 있게 되었습니다."
      },
      {
        "level": "10",
        "description": "풍부한 어휘력을 갖추어 어떤 주제든 막힘없이 자연스럽게 말하고 토론할 수 있으며, 정확한 언어를 떠올리고 활용하는 데 거의 어려움이 없습니다."
      },
      {
        "level": "10+",
        "description": "정교한 어휘력과 표현력을 갖추어 일반적인 주제뿐만 아니라 복잡한 주제도 거의 어려움 없이 말할 수 있으며, 현대적인 단어, 구어체 표현, 속어 등을 원어민과 동일한 수준으로 구사하는 것을 목표로 하고 있습니다."
      }
    ],
    "grammar": [
      { "level": "0", "description": "한국어 학습 경험이 없습니다." },
      {
        "level": "0.5",
        "description": "\"저는 ~예요/이에요\", \"-을/를 좋아해요\" 등의 기초 수준의 짧은 문장은 어느 정도 이해할 수 있습니다."
      },
      {
        "level": "1",
        "description": "기본적인 질문과 주어-동사-목적어 문장 구조를 이해하고 있습니다."
      },
      {
        "level": "1.5",
        "description": "간단하고 짧은 문장에서 단어를 올바르게 배열할 수 있으며, 점점 더 다양한 문법 구조를 이해하고 사용할 수 있도록 공부하고 있습니다."
      },
      {
        "level": "2",
        "description": "제한된 범위의 기본적인 문법과 문장 패턴을 이해하고 있습니다."
      },
      { "level": "2.5", "description": "학습한 문법과 문장 패턴의 범위가 점차 확대되고 있습니다." },
      {
        "level": "3",
        "description": "제한된 범위의 기본적인 문법과 문장 구조를 적절하게 사용할 수 있습니다."
      },
      {
        "level": "3.5",
        "description": "학습한 문법과 문장 패턴을 보다 정확하게 사용할 수 있으며, 동작이나 상태를 표현하는 것이 이전보다 수월해지고 있습니다."
      },
      {
        "level": "4",
        "description": "입문 수준의 문법과 문장 패턴을 올바르게 사용할 수 있습니다. 기본적인 실수는 아직 있지만, 혼란이나 오해가 발생하는 경우는 거의 없습니다."
      },
      {
        "level": "4.5",
        "description": "문법과 문장 패턴을 더욱 정확하게 사용할 수 있게 되었으며, 보다 복잡한 문법을 활용하기 시작했습니다."
      },
      {
        "level": "5",
        "description": "기초 문법과 문장 구조에서 발전이 보이며, 정확성을 더 높이면 좋겠습니다. 기본적인 실수로 인해 문장의 일관성이 크게 떨어지지는 않습니다."
      },
      {
        "level": "5.5",
        "description": "기본적인 문법과 문장 구조의 정확성이 향상되었으나, 보다 정밀한 사용이 필요합니다. 일상적인 문법과 문장 패턴을 점점 더 능숙하게 사용할 수 있습니다."
      },
      {
        "level": "6",
        "description": "자주 사용하는 정형화된 표현과 문장 패턴을 효과적으로 활용할 수 있으며, 비교적 정확합니다. 중급 문법에 대한 이해를 심화하는 과정에 있습니다."
      },
      {
        "level": "6.5",
        "description": "익숙한 상황에서 모국어의 영향을 줄이면서 점점 더 정확하게 자신의 생각을 표현할 수 있습니다. 또한, 중급 문법을 확실하게 이해하기 시작하였습니다."
      },
      {
        "level": "7",
        "description": "익숙한 상황에서는 모국어의 영향을 다소 받으면서도 자신의 생각을 명확하게 표현할 수 있습니다. 실수가 가끔 발생하지만, 전반적인 이해에는 큰 문제가 없습니다."
      },
      {
        "level": "7.5",
        "description": "일상적인 상황을 원활하게 처리할 수 있으며, 보다 고급 문법과 문장 패턴을 사용하기 시작하였습니다. 또한, 복잡한 구조를 보다 유연하고 정확하게 활용할 수 있게 되고 있습니다."
      },
      {
        "level": "8",
        "description": "기본적인 정형화된 문장을 자신 있게 사용할 수 있으며, 보다 고급 문법과 문장 패턴을 정확하고 유연하게 적용하는 과정에 있습니다."
      },
      {
        "level": "8.5",
        "description": "보다 고급 문법을 이해하고 활용할 수 있게 되었으며, 중급에서 고급 수준의 문법과 문장 패턴을 적절하게 사용할 수 있습니다. 또한, 자신의 실수를 스스로 수정할 수 있습니다."
      },
      {
        "level": "9",
        "description": "문법과 문장 구조를 안정적으로 구사할 수 있으며, 사소한 실수가 가끔 발생하더라도 일관되게 스스로 수정할 수 있습니다."
      },
      {
        "level": "9.5",
        "description": "폭넓고 자연스러운 표현과 고급 문법 구조를 자유롭게 사용할 수 있으며, 작은 실수에 대해서도 스스로 수정할 수 있습니다. 거의 완벽한 정확성을 목표로 하고 있습니다."
      },
      {
        "level": "10",
        "description": "다양한 문법 구조를 유창하게 활용하며, 문맥·어조·공식적인 표현 여부에 따른 미묘한 차이를 이해하고 적절하게 사용할 수 있습니다."
      },
      {
        "level": "10+",
        "description": "모든 문법을 완벽하게 통제할 수 있으며, 다양한 문맥·어조·형식에 맞춰 정밀하고 정확하게 활용하는 능력을 마스터해 가고 있습니다."
      }
    ],
    "pronunciation": [
      { "level": "0", "description": "한국어 학습 경험이 없습니다." },
      {
        "level": "0.5",
        "description": "한글(40音)를 배운 경험은 있지만, 아직 완전히 습득하지는 못했습니다."
      },
      {
        "level": "1",
        "description": "발음과 억양에서 모국어의 영향이 강하게 나타나며, 이해하기 어려운 경우가 많습니다."
      },
      {
        "level": "1.5",
        "description": "발음에 뚜렷한 억양이 있으며, 올바른 발음을 구사하기 위해 연습이 필요합니다. 또한, 연결되는 발음과 짧은 단어의 명확한 발음 연습에 집중하고 있습니다."
      },
      {
        "level": "2",
        "description": "익숙한 일부 단어는 다양한 억양에 익숙한 원어민이 어느 정도 알아들을 수 있습니다. 또한, 기본적인 억양과 발음이 점차 정확해지고 있습니다."
      },
      {
        "level": "2.5",
        "description": "짧은 음의 조합을 이해하고 있으며, 발음의 정확도가 높아지고 있습니다. 말할 때 억양이 보다 뚜렷해졌으며, 익숙한 원어민에게는 이해되지만, 가끔 이해를 돕기 위한 노력이 필요할 때도 있습니다."
      },
      {
        "level": "3",
        "description": "간단하고 자주 사용하는 소리를 보다 정확하게 발음할 수 있게 되었습니다. 일상적인 단어나 문구의 억양이 보다 명확해졌지만, 원어민이 이해하는 데 약간의 어려움이 있을 수 있습니다."
      },
      {
        "level": "3.5",
        "description": "발음이 향상되었으며, 여전히 뚜렷한 억양이 존재하지만 이해되는 경우가 많아졌습니다. 말한 내용을 다시 말해 달라는 요청을 받을 때가 많지만, 점점 줄어들고 있습니다."
      },
      {
        "level": "4",
        "description": "발음이 대체로 정확하며, 억양도 충분히 정리되어 있어 외국인 특유의 억양이 있더라도 이해되는 경우가 많습니다. 다만, 복잡한 소리나 억양이 포함된 익숙하지 않은 단어의 경우, 다시 말해 달라는 요청을 받을 수 있습니다."
      },
      {
        "level": "4.5",
        "description": "기본적인 단어의 강세, 억양, 리듬 원칙을 이해하고 연습하는 단계에 있습니다. 익숙한 정보를 보다 명확하게 전달할 수 있으며, 이해도가 높아지고 있습니다."
      },
      {
        "level": "5",
        "description": "말할 때 적절한 끊어 읽기와 문장 중간의 쉬는 부분을 이해하기 시작하면서 전달력이 향상되고 있습니다. 또한, 기본적인 발음 능력이 향상되어, 반복 요청이 줄어들고 있습니다."
      },
      {
        "level": "5.5",
        "description": "초중급 수준의 발음, 억양, 강약 조절이 보다 명확해졌으며, 전체적으로 듣기 편해지고 있습니다. 모국어의 영향은 남아 있지만, 점점 줄어 들고 있습니다."
      },
      {
        "level": "6",
        "description": "발음에서 모국어의 영향이 보이지만, 전반적으로 나아지고 있습니다. 말의 리듬(쉼, 구절 나누기, 단어 및 문장 강세 사용)에 대한 이해가 더욱 깊어지고 있습니다."
      },
      {
        "level": "6.5",
        "description": "배운 발음 개념을 보다 정확하게 적용하여 오해나 혼동이 발생하는 상황을 줄이기 위해 노력하고 있습니다."
      },
      {
        "level": "7",
        "description": "강약 조절, 억양, 소리 연결, 구절 구분, 쉼 등의 초·중급 발음 기술을 보다 잘 이해하고 있으며, 자주 사용하는 단어 및 일반적인 발음의 정확도가 향상되고 있습니다."
      },
      {
        "level": "7.5",
        "description": "강약 조절, 억양, 소리 연결, 구절 구분, 쉼 등의 발음 개념을 보다 잘 이해하고 실천할 수 있게 되었습니다. 동시에, 모국어의 영향이 줄어들면서 더욱 듣기 편한 발음을 구사하고 있습니다."
      },
      {
        "level": "8",
        "description": "발음 상의 억양과 강약 조절이 대체적으로 좋습니다. 여전히 모국어의 영향이 약간 남아 있지만, 충분히 명확하여 거의 문제가 되지 않습니다."
      },
      {
        "level": "8.5",
        "description": "연결 발음(연음)에 대한 이해가 깊어지면서 말하기가 자연스러워지고 있습니다. 흔히 사용되지 않는 억양 패턴을 개선하기 위해 노력하고 있습니다."
      },
      {
        "level": "9",
        "description": "억양과 강세를 효과적으로 사용할 수 있으며, 발음이 명확하고 또렷합니다. 모국어 억양이 남아 있어도 이해하는 데 거의 방해가 되지 않습니다."
      },
      {
        "level": "9.5",
        "description": "대부분의 발음을 자연스럽게 활용할 수 있으며, 실수가 거의 없습니다. 또한, 음성 조절과 같은 고급 발음 기술도 사용할 수 있습니다."
      },
      {
        "level": "10",
        "description": "발음을 유창하게 조절할 수 있으며, 명확한 대화가 가능합니다. 대부분 정확하고 정밀하게 발음합니다."
      },
      {
        "level": "10+",
        "description": "원어민과 같은 수준의 완전한 숙달을 목표로 하고 있습니다. 발성의 강약 조절이나 소리 조절 등 고급 발음 기술을 익혀 가고 있습니다."
      }
    ],
    "listening": [
      { "level": "0", "description": "한국어 학습 경험이 없습니다." },
      { "level": "0.5", "description": "기초 단어나 짧은 문장은 대체로 이해할 수 있습니다." },
      {
        "level": "1",
        "description": "말이 천천히, 또박또박 발음되면, 기본적인 소리와 일상적으로 쓰이는 간단한 단어를 알아들을 수 있습니다."
      },
      {
        "level": "1.5",
        "description": "일상적인 상황에서 천천히 또렷하게 말하면 익숙한 단어를 알아들을 수 있습니다. 익숙한 주제에서 세부 정보를 파악하는 연습을 하고 있습니다."
      },
      {
        "level": "2",
        "description": "일반적인 억양 패턴과 단어의 간단한 강약 정도를 구별할 수 있습니다. 또한 말이 천천히, 또렷하게 전달된다면. 문맥과 시각적 단서를 활용해 기본적인 의미와 명확한 표현을 이해할 수 있습니다"
      },
      {
        "level": "2.5",
        "description": "명확한 발음을 따라가며 이해하는 연습을 하고 있습니다. 정보를 처리, 해결하기 위해서는 시간이 걸릴 수 있습니다. 말하는 중간중간 쉬는 시간이 필요합니다."
      },
      {
        "level": "3",
        "description": "이해를 위한 시간이 필요하지만, 천천히 또렷하게 말하면 이해할 수 있습니다. 명확한 강약 구분, 기본적인 억양을 구별할 수 있으며, 문맥을 활용해 의미를 파악하는 능력을 키우고 있습니다."
      },
      {
        "level": "3.5",
        "description": "발음이 분명하고 느린 속도로 들으면, 개인 정보나 가족에 관한 정보 등 중요한 회화 상황에서 사용되는 구절과 표현을 이해할 수 있습니다."
      },
      {
        "level": "4",
        "description": "억양과 강세에 대한 이해가 점점 깊어지고 있으며, 일상에서 자주 사용하는 중요한 표현이 더욱 쉽게 들리기 시작했습니다."
      },
      {
        "level": "4.5",
        "description": "듣는 말이 천천히 명확하게 발음될 때, 말하는 단어들을 더 이해하기 쉬운 단위로 나누어 이해하려는 연습을 하고 있습니다."
      },
      {
        "level": "5",
        "description": "명확하고 천천히 전달되는 말을 듣고, 필요한 정보를 충분히 파악할 수 있습니다."
      },
      {
        "level": "5.5",
        "description": "말을 천천히 들으면서, 핵심 내용을 파악하기 위해 말의 흐름을 구분하는 연습을 하고 있습니다. 일, 학교, 취미, 일상적인 대화 등 익숙한 주제의 내용을 점점 더 이해하고 있습니다."
      },
      {
        "level": "6",
        "description": "일, 학교, 취미, 소소한 대화 등 자주 접하는 일상적인 주제에서 중요한 내용을 이해할 수 있습니다."
      },
      {
        "level": "6.5",
        "description": "적당한 속도로 진행되는 일상 대화나 직장 관련 대화를 듣고 이해할 수 있는 능력이 향상되고 있습니다. 익숙하지 않은 억양에도 점점 적응하고 있습니다."
      },
      {
        "level": "7",
        "description": "직장과 일상생활에서 자주 접하는 일반적인 주제를 이해할 수 있으며, 주요 내용을 파악하고, 말 속의 뉘앙스를 구별하는 능력이 향상되고 있습니다. 다소 빠른 속도로 말하는 원어민의 말도 듣고 이해할 수 있습니다."
      },
      {
        "level": "7.5",
        "description": "다양한 상황에서 세부적인 정보나 복잡한 논의를 이해할 수 있게 되었습니다. 다른 악센트나 빠른 말 속도에도 문맥과 단어의 흐름을 통해 내용을 따라갈 수 있습니다."
      },
      {
        "level": "8",
        "description": "다양한 주제, 복잡한 논의에서 핵심 내용을 이해할 수 있으며, 일반적인 대화 속도 전제 하에 본인의 전문 분야와 관련된 기술적인 내용도 이해할 수 있습니다. 빠른 속도로 말하는 원어민의 대화도 이해할 수 있습니다."
      },
      {
        "level": "8.5",
        "description": "일상적인 주제뿐만 아니라 전문적인 주제에서도 주요 내용을 이해할 수 있습니다. 다양한 상황에서의 대화 이해도가 높아지고 있습니다."
      },
      {
        "level": "9",
        "description": "일과 일상생활뿐만 아니라, 익숙하지 않은 주제에서도 내용을 이해할 수 있습니다. 원어민이 자연스럽게 빠른 속도로 이야기하는 것도 알아들을 수 있습니다."
      },
      {
        "level": "9.5",
        "description": "다양한 주제에 대한 긴 대화 속에서 세부 사항과 핵심 내용을 파악하기 위해 문맥적 단서를 찾는 능력이 있으며, 높은 수준의 듣기 실력을 갖추고 있습니다. 네이티브의 빠른 말이나 다양한 악센트에도 익숙해지고 있지만, 가끔 내용을 확인해야 할 때가 있습니다"
      },
      {
        "level": "10",
        "description": "원어민과 같은 속도로 말하는 대화를 이해할 수 있으며, 전문 분야가 아닌 복잡하고 세밀한 내용도 요점과 미묘한 뉘앙스를 정확히 파악할 수 있습니다. 다만, 익숙하지 않은 악센트가 나올 경우, 가끔 확인이 필요할 수도 있습니다."
      },
      {
        "level": "10+",
        "description": "익숙하지 않은 분야에 대한 긴 대화도 이해할 수 있게 되었습니다. 미묘한 논의나 복잡한 세부 사항, 다양한 악센트도 쉽게 파악할 수 있는 고급 수준의 듣기 기술을 습득해 가고 있습니다."
      }
    ],
    "conversation": [
      { "level": "0", "description": "한국어 학습 경험이 없습니다." },
      {
        "level": "0.5",
        "description": "기초 단어나 짧은 문장에는 반응할 수 있지만, 의사소통은 아직 어렵습니다."
      },
      {
        "level": "1",
        "description": "자신의 일상적인 습관이나 행동에 대해서 짧고 간단한 표현이 가능하고, 제스처 등의 비언어적 요소를 활용하여 질문하거나 답할 수 있습니다."
      },
      {
        "level": "1.5",
        "description": "기본적인 짧은 대화에 익숙해지고 있으며, 이해를 위해 반복, 천천히 말하기, 바꿔 말하기 등에 의존하는 경향이 있습니다."
      },
      {
        "level": "2",
        "description": "기본적인 의사소통은 가능하지만, 천천히 말하거나 반복해서 설명해 주어야 이해할 수 있습니다. 단순한 문장 구조를 활용하여 기본적인 일상적인 내용이나 자신의 취향을 표현할 수 있습니다."
      },
      {
        "level": "2.5",
        "description": "기본적인 정보를 전달하기 위해 간단한 문장을 구성할 수 있으며, 대답을 보다 자세히 하고 적절한 질문을 만들기 위해 노력하고 있습니다."
      },
      {
        "level": "3",
        "description": "단순하고 일반적인 대화를 할 수 있으며, 반복 연습과 말하는 속도 조절을 통해 원활한 의사소통을 하기 위해 노력하고 있습니다."
      },
      {
        "level": "3.5",
        "description": "간단한 주제와 관련된 대화나 직접적인 정보 공유를 하면서, 보다 자연스러운 대화가 가능하도록 노력하고 있습니다."
      },
      {
        "level": "4",
        "description": "직장이나 취미와 관련된 기본적인 의사소통이 가능하며, 간단하고 짧은 대화는 큰 어려움 없이 할 수 있습니다."
      },
      {
        "level": "4.5",
        "description": "긴 문장을 활용하여 이야기의 흐름을 연결하고, 사건의 순서를 설명할 수 있게 되어 가고 있습니다. 익숙한 주제에 대해 자신 있게 대화를 시작하고 이어나갈 수 있습니다."
      },
      {
        "level": "5",
        "description": "간단한 대화에 무리 없이 참여할 수 있으며, 필요할 때 적절히 도움을 요청할 수 있습니다. 일상적인 상황에서 익숙한 주제에 대해 자신의 생각을 표현할 수 있습니다."
      },
      {
        "level": "5.5",
        "description": "익숙한 주제에 대해 보다 자연스럽게 대화를 이끌어나가기 위해 연습하고 있으며, 사전 준비 없이도 자신의 경험이나 일상을 더욱 정리된 방식으로 이야기할 수 있습니다."
      },
      {
        "level": "6",
        "description": "익숙한 주제에 대해 즉흥적으로 대화에 참여하고, 자신의 견해를 공유하며, 일상적인 문제에 대해 이야기할 수 있습니다. 또한, 더 정확한 이해를 위해 다시 질문할 수 있고, 내용을 명확히 설명하며, 바꿔 말하는 능력 역시 향상되고 있습니다."
      },
      {
        "level": "6.5",
        "description": "익숙한 주제뿐만 아니라 다소 생소한 개인적·직업적 주제에 대해서도 점점 더 편안하게 대화를 나누며, 다양한 상황에서의 정보 확인 및 교환이 가능합니다."
      },
      {
        "level": "7",
        "description": "개인적·직업적 분야의 다소 어려운 주제에 대해서도 비교적 원활하게 소통할 수 있으며, 필요에 따라 세부 사항을 확인하고 조정할 수 있습니다."
      },
      {
        "level": "7.5",
        "description": "다양한 주제에 대해 길고 복잡한 대화를 이어갈 수 있게 되어 가고 있으며, 자신의 의견을 적절한 표현을 사용해 전달하고, 상대의 의견에 논리적으로 반박하는 연습을 하고 있습니다."
      },
      {
        "level": "8",
        "description": "별다른 노력 없이도 자연스럽고 매끄러운 대화를 이어갈 수 있으며, 의미 있는 의사소통이 가능합니다."
      },
      {
        "level": "8.5",
        "description": "유창하고 자연스러운 대화가 가능하며, 상황에 따라 공식적이고, 정식적인 표현도 할 수 있습니다. 자세하고 명확히 설명할 수 있고, 논리적인 근거를 바탕으로 상대를 설득하는 능력을 갖추어 가고 있습니다."
      },
      {
        "level": "9",
        "description": "자신의 생각과 아이디어를 자유롭고 정확하게 표현할 수 있으며, 필요에 따라 공식적인 표현도 적절히 조정할 수 있습니다."
      },
      {
        "level": "9.5",
        "description": "유창하고 자연스러운 의사소통 능력에 도달해 가고 있으며, 언어 구조와 공식적인 표현을 매우 잘 이해하고 있습니다. 또한, 미묘한 의미의 차이를 설명 할 수 있고, 추상적이고 복잡한 주제를 다루며, 고급 표현을 활용하는 능력이 향상되고 있습니다."
      },
      {
        "level": "10",
        "description": "다양한 주제에 대해 자신 있게 대화할 수 있으며, 단어를 유연하고 정확하게 사용하여 자연스럽게 자신의 생각을 전달할 수 있습니다. 필요에 따라 어조나 공식적인 표현도 조정할 수 있습니다."
      },
      {
        "level": "10+",
        "description": "어떤 주제에 대해서도 즉흥적으로 자연스럽게 대화할 수 있으며, 문화적 배경이나 관용 표현도 자연스럽게 익혀 활용할 수 있습니다. 또한, 추상적이고 복잡한 논의를 깊이 있게 이해하고 정확하게 표현할 수 있도록 연습하고 있습니다."
      }
    ]
  },
  "japanese": {
    "vocabulary": [
      { "level": "0", "description": "日本語の学習経験がありません。" },
      {
        "level": "0.5",
        "description": "「こんにちは」「ありがとう」などの基本的な挨拶はおおよそ理解しています。"
      },
      {
        "level": "1",
        "description": "自分自身に関する情報を表現するための非常に基本的な単語や、ごく単純な表現を知っている。"
      },
      {
        "level": "1.5",
        "description": "日常的によく使用する一般的な単語や表現を少しずつ覚え、使うことができるようになっている。"
      },
      { "level": "2", "description": "日常的によく使用する基本的な語彙を理解している。" },
      {
        "level": "2.5",
        "description": "日常的によく使用する基本的な言葉やフレーズの語彙がどんどん増えている。"
      },
      { "level": "3", "description": "個人情報に関する語彙や、実用的な単語や表現を理解している。" },
      {
        "level": "3.5",
        "description": "個人情報や日常的な事柄に関する基本的な語彙を備えており、それらについて十分な理解を深めようとしている。"
      },
      {
        "level": "4",
        "description": "基本的なコミュニケーションと生存に必要な状況に対応できる十分な語彙を備えている。"
      },
      {
        "level": "4.5",
        "description": "基本的なコミュニケーションと、生存に必要な状況に十分に対応でき、中級レベルの対話や話題に必要な語彙が増えてきている。"
      },
      {
        "level": "5",
        "description": "日常的な会話や共通の話題に関する語彙がしっかりと定着している。"
      },
      {
        "level": "5.5",
        "description": "身近な話題や日常的なテーマに対応できる十分な語彙を持ち、より幅広い日常生活の話題に対応するための語彙を引き続き増やしている。"
      },
      {
        "level": "6",
        "description": "個人の興味、職業、旅行、最近のニュースなどの話題について話すのに十分な語彙力を持っているが、一部言い換えが必要になることがある。"
      },
      {
        "level": "6.5",
        "description": "日常的で馴染みのあるコミュニケーションや話題に対応でき、より高い言語能力の実現を目指している。"
      },
      {
        "level": "7",
        "description": "実用的な語彙を備えており、馴染みのあるの話題や日常の出来事に比較的スムーズに対応できる。"
      },
      {
        "level": "7.5",
        "description": "馴染みのある話題や日常的状況に対する語彙を広範囲に備えており、専門分野やその他の関心分野での高度なまたは自然な言葉の使用を目指している。"
      },
      {
        "level": "8",
        "description": "さまざまな状況や話題で、具体的かつ自然な言葉を使うことができる。特に、すでに専門知識を持っている分野では、より的確に表現できる。"
      },
      {
        "level": "8.5",
        "description": "自分の専門分野や興味のある分野で多くの専門的な語彙を使用する能力があり、他の未知の分野においても専門用語や言葉を習得しようとしている。"
      },
      {
        "level": "9",
        "description": "専門的なテーマや日常的な話題において、専門用語や自然な表現を高いレベルで使いこなせる。"
      },
      {
        "level": "9.5",
        "description": "あまり明確ではない表現や言い換えを使わず、より専門的かつ自然な語彙を活用できるようになっている。"
      },
      {
        "level": "10",
        "description": "言語を自在に使い、あらゆる話題についてスムーズに話し、正確に言葉を引き出し、思い出し、使用するのにほとんど問題がない。"
      },
      {
        "level": "10+",
        "description": "精緻な語彙範囲と言語スキルを持ち、一般的な話題や複雑なテーマを容易に議論できる。また、現代的な単語、口語表現、スラングにおいて、母国語話者の表現方法と遜色なく使いこなすことを目指している。"
      }
    ],
    "grammar": [
      { "level": "0", "description": "日本語の学習経験がありません。" },
      {
        "level": "0.5",
        "description": "「私は〜人です」「〜が好きです」などの初級の短い文はある程度理解しています。"
      },
      { "level": "1", "description": "ごく単純な語順を使い、短い文を使用できる。" },
      {
        "level": "1.5",
        "description": "正しく単語を並べ簡単な短い文を作る能力があり、いくつかの文法を理解して使うことに取り組んでいる。"
      },
      { "level": "2", "description": "限られた範囲の基本的な文法と文のパターンを理解している。" },
      { "level": "2.5", "description": "学んだ文法と文のパターンが増えている。" },
      { "level": "3", "description": "限られた範囲の基本的な文法と文構造をうまく使用できる。" },
      {
        "level": "3.5",
        "description": "学んだ文法と文のパターンを正確に使用できつつある。行動や状態を表現するのが前より楽になってきている。"
      },
      {
        "level": "4",
        "description": "入門レベルの文法や文型を正しく使用することができる。基本的なミスはまだあるが、混乱や誤解はほとんど起こらない。"
      },
      {
        "level": "4.5",
        "description": "文法と文のパターンが更に正確に使用できるようになり、より複雑な文法を使い始めている。"
      },
      {
        "level": "5",
        "description": "初歩的な文法や文の構造に進歩が見られるが、さらに正確性を高める余地がある。基本的なミスによって文章の一貫性が大きく損なわれることはない。"
      },
      {
        "level": "5.5",
        "description": "基本的な文法や文の構造の精度が向上しているが、さらに正確にする必要がある。日常的な文法や文型の使用に慣れてきている。"
      },
      {
        "level": "6",
        "description": "よく使う定型表現や文型を使いこなせており、比較的正確である。中級レベルの文法の理解を深めている途中である。"
      },
      {
        "level": "6.5",
        "description": "よく知っている状況において、母語の影響を抑えながら、一貫してより正確に自分の考えを表現できるようになってきている。また、中級レベルの文法をしっかりと理解し始めている。"
      },
      {
        "level": "7",
        "description": "よく知っている状況では、母語の影響を多少受けつつも、考えをはっきり表現できる。時々ミスはあるが、理解しやすい。"
      },
      {
        "level": "7.5",
        "description": "日常的な場面にうまく対応できるようになり、より高度な文法や文型を使い始めている。また、複雑な構造をより柔軟かつ正確に使えるようになっている。"
      },
      {
        "level": "8",
        "description": "基本の定型文を自信を持って使いこなし、より高度な文法や文型を正確かつ柔軟に取り入れている途中である。"
      },
      {
        "level": "8.5",
        "description": "より高度な文法を理解し使用できるようになっている。中級から上級レベルの文法や文型を適切に使いこなし、ミスを自分で修正できる。"
      },
      {
        "level": "9",
        "description": "文法や文の構造をしっかりと把握している。わずかなミスがまれにあるが、一貫して自分で修正できる。"
      },
      {
        "level": "9.5",
        "description": "幅広い自然な表現や高度な文法構造を使いこなし、些細なミスに対しても自己修正が可能である。ほぼ完璧な正確性を目指している。"
      },
      {
        "level": "10",
        "description": "幅広い文法構造を流暢に使い、文脈・語調・形式の微妙な違いを理解し、適切に使い分けることができる。"
      },
      {
        "level": "10+",
        "description": "あらゆる文法を完全にコントロールできており、異なる文脈・語調・形式に応じて正確に使い分ける能力を極めつつある。"
      }
    ],
    "pronunciation": [
      { "level": "0", "description": "日本語の学習経験がありません。" },
      {
        "level": "0.5",
        "description": "五十音を学習した経験がありますが、まだ完全には習得していません。"
      },
      { "level": "1", "description": "発音やアクセントは母国語の影響が強く、理解が難しい。" },
      {
        "level": "1.5",
        "description": "発音には顕著な訛りがあり、正しく発音できるように練習が必要である。五十音の発音（清音/濁音/拗音/促音/長音等）と短い単語を明確に発音することに取り組んでいる。"
      },
      {
        "level": "2",
        "description": "いろいろなアクセントに慣れているネイティブスピーカーに対してなら、短い単語の発音は伝わる。基本的なアクセントや発音も少しずつ正しくなってきている。"
      },
      {
        "level": "2.5",
        "description": "短い音の組み合わせを理解し、より正確に発音できるようになってきている。話すときにイントネーションがはっきりし始めた。話し慣れているネイティブスピーカーには理解されるが、時々努力が必要なことがある。"
      },
      {
        "level": "3",
        "description": "簡単でよく使われる音を正しく発音できることが増えてきた。日常的な単語やフレーズのイントネーションがはっきりしてきた。ただ、ネイティブスピーカーが理解するのに少し苦労することもある。"
      },
      {
        "level": "3.5",
        "description": "発音は上達し、目立つ訛りがあるものの理解されるようになってきた。話した言葉を繰り返すよう求められることはまだ多いが、徐々に減ってきている。"
      },
      {
        "level": "4",
        "description": "発音はおおむね正しく、イントネーションも十分に整っているため、外国語特有のアクセントがあっても理解されることが多い。ただし、より複雑な音やイントネーションが含まれる知らない単語については、繰り返し求められることがある。"
      },
      {
        "level": "4.5",
        "description": "基本的な単語のイントネーション、リズムの原則を理解し、練習している段階にある。その結果、よく知っている情報をより明確に伝えられるようになり、理解される頻度が高まっている。"
      },
      {
        "level": "5",
        "description": "発話の中で適切に区切ったり、間を取ったりすることを理解し始めており、伝わりやすさが向上している。基本的な発音の基礎も改善されており、繰り返し求められることが減ってきている。"
      },
      {
        "level": "5.5",
        "description": "基本から中級レベルの発音、イントネーション、強弱がより明確になり、全体的に聞き取りやすくなってきている。母語の影響はあるものの、理解されることが増えている。"
      },
      {
        "level": "6",
        "description": "発音には依然として母語の影響が見られるものの、全体的にその影響は減少している。話す際のリズム、つまり適切な間の取り方、フレーズの区切り、単語や文の強勢の使い方をよりよく理解できるようになっている。"
      },
      {
        "level": "6.5",
        "description": "学んだ発音の概念をさらに正確に使えるよう改善している段階にあり、それにより誤解や混乱が生じる場面が減少してきている。"
      },
      {
        "level": "7",
        "description": "強弱、イントネーション、音声、フレーズの区切り、間の取り方などの基本から中級レベルの発音技術をより理解しており、よく使う単語や一般的な発音の正確さが向上している。"
      },
      {
        "level": "7.5",
        "description": "強弱、イントネーション、音声、フレーズの区切り、間の取り方などの発音の概念をよりよく理解し、実践できるようになってきている。同時に、母語の影響が減少し、より聞き取りやすくなっている。"
      },
      {
        "level": "8",
        "description": "イントネーションと強弱は概ねうまく使われている。アクセントには母語の影響が少しだけ見られるが、十分に明確でありほとんど問題がない。"
      },
      {
        "level": "8.5",
        "description": "音のつながりについてより深く理解しており、話す際の言葉の流れを改善している。あまり使われないイントネーションの改善にも取り組んでいる。"
      },
      {
        "level": "9",
        "description": "イントネーションと強弱を効果的に使っている。発音は明瞭で、はっきりと発音されている。母国語のアクセントがあっても、ほとんど理解の妨げにならない。"
      },
      {
        "level": "9.5",
        "description": "ほとんどの発音の概念を難なく使いこなし、ほとんどミスがない。声の使い方などの高度な発音技術も使用している。"
      },
      {
        "level": "10",
        "description": "発音の概念を完全にコントロールし、明瞭な会話を維持している。ほとんどの音は高い精度と正確さで発音されている。"
      },
      {
        "level": "10+",
        "description": "ネイティブスピーカーと同じレベルの完全な習得を目指している。発声の投影や音の調整など、高度な発音技術を身につけつつある。"
      }
    ],
    "listening": [
      { "level": "0", "description": "日本語の学習経験がありません。" },
      { "level": "0.5", "description": "初級の単語や短い文は概ね理解できます。" },
      {
        "level": "1",
        "description": "話し方がゆっくりで明瞭に発音されている場合、基本的な音や日常的に使う簡単な単語を聞き取ることができる。"
      },
      {
        "level": "1.5",
        "description": "日常的な状況で、ゆっくりと明確に話された場合であれば、よく知られた単語を識別できる。よく知っている話題の詳細を話すことに取り組んでいる。"
      },
      {
        "level": "2",
        "description": "一般的なイントネーションパターンや単語の簡単な強弱を識別できる。ゆっくりはっきりと話されれば、文脈や視覚的な手がかりを使って基本的な意味やフレーズを理解することができる。"
      },
      {
        "level": "2.5",
        "description": "情報を処理するため話しの間を取る必要がある。ゆっくりはっきりと発音された言葉についていく練習の過程にある。"
      },
      {
        "level": "3",
        "description": "理解するために時間が必要だが、ゆっくりはっきりと話されれば理解できるようになる。明確な強弱や簡単なイントネーションを区別し、文脈に注目して理解を深め始めている。"
      },
      {
        "level": "3.5",
        "description": "個人情報や家族に関する情報など、重要な会話の場面で使われるフレーズや表現の理解を深めている。話し方が明確でゆっくりであれば、理解できるようになる。"
      },
      {
        "level": "4",
        "description": "イントネーションと強弱の理解が進み、日常的で重要なフレーズがより理解しやすくなっている。"
      },
      {
        "level": "4.5",
        "description": "ゆっくりと話された場合、更に理解しやすくするため、単語や文のまとまりごとに区切って考えることができふようになっている。"
      },
      { "level": "5", "description": "明確でゆっくり話されれば、必要な情報を十分に理解できる。" },
      {
        "level": "5.5",
        "description": "適度にゆっくりと話されれば、重要なポイントを理解するために言葉を区切ることに慣れてきている。仕事や学校、趣味などの日常的な話題の内容を理解し始めている。"
      },
      {
        "level": "6",
        "description": "仕事、学校、趣味、雑談などのよくある日常的な話題の重要なポイントを理解できる。"
      },
      {
        "level": "6.5",
        "description": "日常生活や仕事に関する会話を、適度な速さで聞いて理解できるようになってきている。また、慣れないアクセントを聞き取ることにも慣れ始めている。"
      },
      {
        "level": "7",
        "description": "仕事や日常生活に関連する一般的な話題を理解できる能力がある。話の中で主なポイントやニュアンスを識別するのが上手になってきている。ネイティブスピーカーが話す速さでも聞き取ることができる。"
      },
      {
        "level": "7.5",
        "description": "さまざまな状況で、詳細な情報や複雑な議論を理解できるようになってきている。異なるアクセントや速い話し方でも、文脈や言葉のまとまりから、話の内容を追えるようになってきている。"
      },
      {
        "level": "8",
        "description": "さまざまな話題について、複雑な議論の要点を理解できるようになり、専門的な内容も理解できるようになってきている。速いスピードで話すネイティブスピーカーの話も理解できる。"
      },
      {
        "level": "8.5",
        "description": "日常的な話題や専門的な話題について、詳細な説明の中から重要なポイントを理解できるようになってきている。さまざまな状況での会話理解が進んでいる。"
      },
      {
        "level": "9",
        "description": "日常、仕事に関する話題に加え、あまり馴染みのない話題ついても、話された内容を理解する能力がある。ネイティブスピーカーの速さで話す内容も理解できる。"
      },
      {
        "level": "9.5",
        "description": "さまざまな話題に関する長い話の中で、詳細や要点を理解するため、文脈からの手がかりを見つける能力や高度なリスニングスキルがある。ネイティブスピーカーの速さやさまざまなアクセントに慣れてきているが、時々確認を求める必要がある。"
      },
      {
        "level": "10",
        "description": "ネイティブスピーカーと同じ速さで話される言葉を理解することができ、専門外の複雑で細かい内容についても、要点や微妙なニュアンスを正確に読み取ることができる。ただし、普段慣れているアクセントと大きく異なる場合などは、時々、確認が必要となることがある。"
      },
      {
        "level": "10+",
        "description": "慣れ親しんでいない分野についても、長い話を理解できるようになってきている。微妙な議論や複雑な詳細、さまざまなアクセントも簡単に把握できる高度なリスニング技術を習得しつつある。"
      }
    ],
    "conversation": [
      { "level": "0", "description": "日本語の学習経験がありません。" },
      {
        "level": "0.5",
        "description": "初級の単語や短い文には反応できますが、会話による意思疎通はまだできません。"
      },
      {
        "level": "1",
        "description": "自分の日々の決まった行動についてなら、簡単な短いフレーズと、ジェスチャーなどの表現に頼りながら、質問したり質問に答えたりすることができる。"
      },
      {
        "level": "1.5",
        "description": "基本的で短いやり取りに慣れ始めているが、理解する際繰り返し、ゆっくりとした話し方、言い換えなどに頼っている。"
      },
      {
        "level": "2",
        "description": "基本的なやり取りができるが、ゆっくりとした話し方で、繰り返し、言い直しされなければ理解できない。日常的なことや好みを表現するために、簡単な会話の構造を使うことができる。"
      },
      {
        "level": "2.5",
        "description": "情報を伝えるために基本的な文を構築できる。より詳細に回答したり、適切に質問することに取り組んでいる。"
      },
      {
        "level": "3",
        "description": "単純で一般的な会話ができる。理解を深めるために話す速度を調整することでコミュニケーションの向上に努めている。"
      },
      {
        "level": "3.5",
        "description": "簡単な会話タスクや直接的な情報共有を行いながら、もっとスムーズに会話に参加できるよう努力している。"
      },
      {
        "level": "4",
        "description": "仕事や趣味に関連する基本的なやり取りができる。簡単で短い会話も問題なくできる。"
      },
      {
        "level": "4.5",
        "description": "長い文で話の内容を繋げ、順番に出来事を説明できるようになってきている。馴染みのある話題について自信を持って会話を始めたり続けたりできるようになっている。"
      },
      {
        "level": "5",
        "description": "簡単な会話に問題なく参加でき、必要なときに少し助けを求めることができる。日常的な場面で、馴染みのある話題について自分の考えを伝えることができる。"
      },
      {
        "level": "5.5",
        "description": "事前に準備をしなくても、自分のことや日常的な出来事をもっと整理して話せる。慣れた話題なら会話ができるようになっている。"
      },
      {
        "level": "6",
        "description": "慣れた話題についてなら積極的に会話し、自分の考えを共有したり、日常的なことを話したりできる。また、理解を深めるために、わからないことを聞いたり、説明したり、言い換えたりできる。"
      },
      {
        "level": "6.5",
        "description": "日常的なことやあまり馴染みのない個人的・職業的な話題について、情報の確認や交換を含めて、さまざまな状況で話すことにより慣れてきている。"
      },
      {
        "level": "7",
        "description": "個人的・職業的な分野で、少し難しい話題についても比較的スムーズにコミュニケーションが取れるようになっている。必要に応じて詳細を確認することができる。"
      },
      {
        "level": "7.5",
        "description": "さまざまな話題について、長くて複雑な会話を続けられるようになってきている。自分の意見を適切な言葉で伝え、相手の意見に対してうまく反論できるように練習している。"
      },
      {
        "level": "8",
        "description": "特別な努力をせずとも会話が自然な流れでスムーズに進み、意味のあるやり取りができるようになっている。"
      },
      {
        "level": "8.5",
        "description": "流暢で自然な会話ができ、必要に応じてフォーマルさを調整できるようになっている。詳細に話したり、プロセスを明確に説明したり、しっかりとした論理で他人を納得させることができるようになってきている。"
      },
      {
        "level": "9",
        "description": "自分の考えやアイデアを自由かつ正確に表現でき、必要に応じてフォーマルさを調整しながら、言語の正確さを保ち続けることができる。"
      },
      {
        "level": "9.5",
        "description": "言語の構造やフォーマルさをしっかりと把握し、流暢で自然なコミュニケーションに近づいている。微妙な違いを表現したり、抽象的で複雑な話題を扱ったり、高度な話し方を使うことができるようになっている。"
      },
      {
        "level": "10",
        "description": "さまざまな話題について自信を持って対応し、言葉を柔軟かつ正確に使って、自然に自分の考えを伝えることができる。必要に応じて、口調やフォーマルさも調整している。"
      },
      {
        "level": "10+",
        "description": "どんな話題についても、即興で簡単に会話ができるようになってきている。文化的な背景や慣用表現も自然に学び取り、使うことができつつある。抽象的で複雑な議論でも、正確に深く理解し話す練習をしている。"
      }
    ]
  }
}
