{
  "pronunciation": {
    "A1-A2": {
      "strength": [
        "자주 쓰는 단어는 비교적 또렷하게 발음할 수 있다.",
        "간단한 문장에서 중요한 단어가 있을 경우 어느 정도 강조하며 표현할 수 있다.",
        "기본 모음 발음은 대체로 정확한 편이다.",
        "기본적인 억양의 높낮이를 듣고 어느 정도 따라 할 수 있다.",
        "ㅂ/ㅍ 혹은 b/p처럼 자주 나오는 소리 차이는 대체로 구별할 수 있다.",
        "단어를 비교적 정확하게 따라 발음할 수 있다.",
        "신경 써서 들으면 강사의 발음을 따라 발음 할 수 있다.",
        "발음이 잘못됐다는 걸 느끼면 스스로 고치려는 편이다."
      ],
      "weakness": [
        "낯선 소리는 자연스럽게 내기 어려워 하는편이다.",
        "단어의 강세 위치를 자주 헷갈려 한다.",
        "자음이 연달아 나오는 부분의 발음이 불안정한 편이다.",
        "억양 변화가 아직 많지 않아 말투가 평평하게 들릴 때가 많다.",
        "음절 수가 긴 단어는 가끔 발음을 틀릴 때가 있다.",
        "말하는 속도가 느리고 망설임이 두드러질 때가 있다.",
        "단어들이 이어질 때 생기는 발음 변화를 잘 익히지 못한 편이다.",
        "받침 발음이 흐려지거나 빠지는 경우가 있다. (예: ‘잘못’을 ‘잘모’로 발음)"
      ]
    },
    "B1-B2": {
      "strength": [
        "대부분의 단어를 비교적 또렷하게 발음할 수 있다.",
        "필요할 때는 상대가 잘 듣도록 발음을 조절할 수 있다.",
        "자주 쓰는 단어들의 강세 패턴을 이해하고 어느 정도 활용할 수 있다.",
        "문장 끝에서 억양을 올리거나 내리는 것을 대체로 적절히 사용할 수 있다.",
        "문장 안에서 소리를 어느 정도 자연스럽게 이어 발음할 수 있다.",
        "문장의 기본 리듬과 쉬어 가는 지점에 대한 감각이 어느 정도 자리 잡았다.",
        "대부분의 사람들에게 발음이 대체로 잘 전달되는 편이다.",
        "발음이 어색하다고 느끼면 스스로 고쳐 말할 수 있다."
      ],
      "weakness": [
        "길거나 복잡한 단어는 가끔 발음을 틀릴 때가 있다.",
        "문장 안에서 어느 단어에 힘을 줄지 선택이 다소 부자연스러울 때가 있다.",
        "가끔 말을 너무 빨리 해서 발음이 또렷하지 않게 들릴 때가 있다.",
        "말이 빨라지면 축약되거나 약화되는 발음을 자연스럽게 내기 어렵다. (예: 어떻게 해 → 어떡해, 그것이 → 그게, 국물 → 궁물)",
        "가끔 받침을 빼먹거나 너무 약하게 발음하는 경우가 있다.",
        "단어들을 이어서 말할 때 말의 흐름이 다소 부자연스럽게 들릴 때가 있다.",
        "말이 빠르게 오가는 상황에서는 여전히 발음과 말하기가 매끄럽지 않을 때가 있다.",
        "특정 억양이나 발음 방식은 지금도 듣거나 따라 하는 데 어려움이 있다."
      ]
    },
    "C1-C2": {
      "strength": [
        "전반적인 발음이 원어민에 꽤 가까운 편이다.",
        "강세와 억양을 효과적으로 사용해 의미와 감정을 전달할 수 있다.",
        "복잡한 단어도 대부분 또렷하게 발음할 수 있다.",
        "상황의 격식 정도에 따라 발음 스타일을 조절할 수 있다.",
        "소리의 미묘한 차이를 잘 구분해 들을 수 있다.",
        "축약·약화 발음을 자연스럽게 구사할 수 있다. (예: 어떻게 해 → 어떡해, 그것이 → 그게, 국물 → 궁물)",
        "토론 상황에서도 필요하면 발음을 조절해 내용을 더 잘 전달할 수 있다.",
        "원어민에 가까운 리듬과 말의 흐름을 상당히 잘 따라 할 수 있다.",
        "여러 가지 영어 억양과 발음에도 비교적 편안하게 적응한다.",
        "어떤 상황에서도 발음이 자연스럽고 말이 유창한 편이다."
      ],
      "weakness": [
        "가끔은 다소 부자연스럽게 들리는 억양을 따라 할 때가 있다.",
        "특정 음절에 강세를 지나치게 주는 경우가 있다.",
        "자주 쓰이지 않는 특수한 소리는 여전히 가끔 발음이 불안정하다. (예: ‘밟다’, ‘긁다’)",
        "일부 단어는 발음을 너무 또렷이 하려다 다소 인위적으로 들릴 때가 있다.",
        "아주 빠른 말 속에 섞인 미묘한 소리 차이를 가끔 정확히 잡아내지 못한다.",
        "평소 발음에는 거의 문제가 없지만, 외래어·고유명사에서는 약간 머뭇거릴 때가 있다. (예: 프랜차이즈, 브이로그, 프로필)",
        "발음을 고치려다 오히려 말의 흐름이 끊기는 경우가 가끔 있다.",
        "발음을 너무 완벽하게 하려다가 오히려 말이 덜 자연스러워질 때가 있다.",
        "잘 접하지 못한 억양을 들으면, 익숙해지기까지 시간이 조금 걸릴 때가 있다.",
        "전문 용어의 강세 위치를 가끔 헷갈려 하는 편이다."
      ]
    }
  },
  "vocabulary": {
    "A1-A2": {
      "strength": [
        "일상적인 상황에서 쓰는 기본 어휘를 알고 있다.",
        "자주 쓰이는 명사·동사·형용사를 사용할 수 있다.",
        "익숙한 사물이나 주제를 들으면 알아듣고 이해할 수 있다.",
        "익숙한 사람과 장소에 대해 간단히 설명할 수 있다.",
        "기본적인 하루 일과에 대해 말할 수 있다.",
        "간단한 어휘를 사용해 기본적인 질문을 할 수 있다.",
        "몇 가지 기초적인 상용 표현을 이해할 수 있다.",
        "일상생활에서 자주 쓰이는 기본 어휘를 비교적 잘 알고 있다."
      ],
      "weakness": [
        "자신의 생각을 표현할 때 사용할 수 있는 어휘 범위가 제한적이다.",
        "알맞은 단어가 잘 떠오르지 않아, 주변의 도움을 필요로 할 때가 많다.",
        "대화 중에 단어가 바로 떠오르지 않아 어려움을 겪는다.",
        "동의어나 비슷한 의미의 어휘를 구분해서 쓰는 데 어려움이 있다.",
        "같은 단어를 반복해서 사용하는 경향이 있다.",
        "추상적인 개념이나 감정을 말로 잘 표현하지 못한다.",
        "낯선 주제에 대해 설명할 수 있는 어휘가 부족하다.",
        "대화에서 더 정확하고 다양한 어휘가 필요하다."
      ]
    },
    "B1-B2": {
      "strength": [
        "적절한 어휘를 사용해 자신의 의견을 비교적 분명하게 표현할 수 있다.",
        "조금만 준비하면 익숙한 개념을 설명할 수 있다.",
        "자주 쓰이는 일부 관용 표현을 이해하고 사용할 수 있다.",
        "자신의 경험을 어느 정도 구체적으로 묘사할 수 있다.",
        "형용사와 부사를 사용해 표현을 더 세부적이고 풍부하게 만들 수 있다.",
        "익숙한 대부분의 주제에 대해 비교적 편안하게 이야기할 수 있다.",
        "도움을 받으면 덜 익숙한 주제에 대해서도 이야기할 수 있다.",
        "자신의 경험이나 앞으로의 계획에 대해 말할 수 있다."
      ],
      "weakness": [
        "미묘한 뉘앙스나 전문적인 어휘 사용에는 아직 부족한 점이 있다.",
        "복잡한 생각을 표현할 때 적절한 단어가 바로 떠오르지 않을 때가 있다.",
        "특정 사회적 상황에서 필요한 어휘가 부족한 편이다.",
        "말하는 중에 사용하고 싶은 단어가 즉시 떠오르지 않을 때가 있다.",
        "단어를 자연스러운 조합으로 쓰는 데 어려움이 있다. 예) 숙제를 하다(O), 숙제를 쓰다(X)",
        "더 고급스럽고 자연스러운 어휘에 대한 노출과 축적이 더 필요하다.",
        "복잡한 주제를 말할 때 같은 단어를 반복해서 쓰는 경우가 있다.",
        "전문적이거나 격식 있는 상황에서도 여전히 기본적인 어휘에 의존하는 편이다."
      ]
    },
    "C1-C2": {
      "strength": [
        "복잡한 주제에 대해서도 매우 폭넓은 어휘를 갖추고 있다.",
        "자신의 생각과 의견을 섬세한 뉘앙스까지 표현할 수 있다.",
        "관용 표현과 구어체 표현도 자연스럽게 활용할 수 있다.",
        "상황과 상대에 따라 어휘 선택을 유연하게 조절할 수 있다.",
        "고급 형용사와 부사를 사용해 표현을 더욱 풍부하게 만들 수 있다.",
        "추상적인 개념도 유창하게 설명할 수 있다.",
        "자신의 입장과 관점을 정확한 어휘로 표현할 수 있다",
        "단어를 자연스러운 조합으로 잘 활용할 수 있다. (예: 숙제를 하다(O), 숙제를 쓰다(X)",
        "학술적이거나 격식을 갖춘 상황에서도 적절한 어휘를 사용할 수 있다",
        "다양한 분야의 폭넓은 주제에 대해 부담 없이 대화를 이어갈 수 있다"
      ],
      "weakness": [
        "맥락에 완전히 맞지 않는 단어를 가끔 선택할 때가 있다.",
        "표현이 필요 이상으로 복잡해질 때가 있다.",
        "특정 분야의 전문 용어 사용에는 여전히 발전의 여지가 있다.",
        "매우 고급 기술 용어의 의미나 쓰임을 이해하는 데 어려움을 느낄 때가 있다.",
        "실수는 거의 없지만, 어휘 선택이 다소 반복적으로 느껴질 때가 있다",
        "복잡한 단어를 드물게 잘못 사용하거나 어색하게 쓸 때가 있다",
        "일상 대화에서 불필요하게 자세한 표현을 쓸 때가 있다",
        "매우 고급 학술·전문 주제에서는 세부 표현과 정확성을 더 높일 필요가 있다.",
        "매우 드문 어휘의 사용에서는 가끔 확신이 서지 않을 때가 있다",
        "상황에 비해 너무 격식 있는 표현을 쓰는 경우가 있다"
      ]
    }
  },
  "listening": {
    "A1-A2": {
      "strength": [
        "일상에서 자주 쓰는 표현을 들으면 이해할 수 있다.",
        "말이 천천히 또렷하게 들리면 대체로 알아들을 수 있다.",
        "문맥 속에서 익숙한 단어를 알아들을 수 있다.",
        "기본적인 인사말과 쉬운 질문을 들으면 이해할 수 있다.",
        "수업 시간에 나오는 간단한 지시를 대체로 알아들을 수 있다.",
        "짧고 쉬운 문장을 들으면 이해할 수 있다.",
        "듣는 동안 핵심 단어 몇 개를 포착할 수 있다.",
        "간단한 부탁이나 요청을 들으면 이해할 수 있다.",
        "예/아니요로 대답하는 기본적인 질문을 들으면 이해할 수 있다."
      ],
      "weakness": [
        "같은 말을 여러 번 들으면 더 잘 이해하는 편이다.",
        "속도가 조금 빠르거나 자연스러우면 내용을 따라가기 어렵다.",
        "긴 대화에서는 세부 내용을 자주 놓치는 편이다.",
        "평소와 다른 억양이나 발음은 잘 알아듣기 어렵다.",
        "그림이나 제스처 같은 시각적 단서가 있으면 이해하기가 더 쉽다.",
        "일부는 알아들어도 전체 의미까지는 파악하지 못할 때가 있다.",
        "연음이나 줄여 말하는 구어체 발음은 잘 구별하지 못하는 편이다.",
        "들은 내용을 이해하고 정리하는 데 시간이 조금 더 걸린다."
      ]
    },
    "B1-B2": {
      "strength": [
        "일반적인 대화에서는 전체적인 요지를 잘 파악하는 편이다.",
        "익숙한 주제라면 보통 속도의 말하기도 대체로 따라갈 수 있다.",
        "편한 대화 상황에서 화자의 대략적인 의도는 잘 알아차리는 편이다.",
        "격식 있는 말투와 일상적인 말투를 구분해서 들을 수 있다.",
        "구성이 단순한 쉬운 이야기는 대체로 잘 알아듣는다.",
        "조금만 집중하면 기본적인 설명과 해설을 이해할 수 있다.",
        "길게 이어지는 말에서도 핵심 내용은 어느 정도 잡아낸다.",
        "대부분의 일상 상황에서 필요한 듣기 과제는 처리할 수 있는 편이다.",
        "일반적인 안내 방송이나 지시 내용은 대체로 이해할 수 있다."
      ],
      "weakness": [
        "말 속에 숨은 뜻을 알아채지 못할 때가 있다.",
        "관용 표현과 자연스러운 구어 표현에 대한 노출이 여전히 부족한 편이다.",
        "내용이 복잡한 토론에서는 가끔 일부를 잘못 이해할 때가 있다.",
        "억양이 강하거나 사투리 억양과 발음은 알아듣기 어렵다.",
        "말이 빠르게 오가는 토론에서는 자주 따라가기 힘들어한다.",
        "전문적이거나 기술적인 주제에서는 자주 추가 설명을 필요로 한다.",
        "대화 주제가 살짝 바뀔 때 그 변화를 눈치채지 못할 때가 있다.",
        "농담이나 빈정거리는 말투를 가끔 그대로 받아들이지 못한다.",
        "말이 매우 빠르고 구어체나 속어가 많이 섞이면 이해하기가 특히 어렵다."
      ]
    },
    "C1-C2": {
      "strength": [
        "원어민이 자연스럽고 다소 빠르게 말해도 대부분 잘 알아들을 수 있다.",
        "화자의 말투나 톤이 조금 달라지는 것도 잘 알아챈다.",
        "말 속에 숨은 의미와 뉘앙스의 차이도 잘 이해한다.",
        "뉴스, 강의, 일반적인 토론도 큰 부담 없이 따라갈 수 있다.",
        "유머, 풍자, 반어적 표현도 맥락 속에서 이해할 수 있다.",
        "여러 사람이 참여하는 토론이나 패널 토의의 내용도 이해할 수 있다.",
        "복잡한 학술·전문 분야의 내용도 흐름을 따라 이해할 수 있다.",
        "주변에 소음이 있어도 대화 내용을 대체로 잘 알아들을 수 있다.",
        "격식 있는 말투와 일상적인 말투 모두 익숙해서 이해하는 데 큰 부담이 없다.",
        "말의 높낮이와 억양을 통해 화자의 감정과 태도를 파악할 수 있다."
      ],
      "weakness": [
        "억양이 아주 강한 발음은 여전히 가끔 듣기 어렵다.",
        "특정 문화적 배경을 전제로 한 표현은 가끔 완전히 이해하기 어렵다.",
        "가끔 말을 과하게 분석해서 오히려 이해가 복잡해질 때가 있다.",
        "매우 전문적인 용어가 많이 나오면 지금도 이해가 쉽지 않은 편이다.",
        "여러 사람이 동시에 말할 때는 가끔 누가 무엇을 말하는지 따라가기 어렵다.",
        "낯선 사투리를 들으면 여전히 적응하는 데 시간이 조금 필요하다.",
        "아주 추상적이거나 철학적인 논의는 여전히 이해하기 힘든 편이다.",
        "일부러 애매하게 말한 표현을 가끔 다르게 받아들여 오해할 때가 있다.",
        "관용 표현의 미묘한 변형이나 말 바꾸기는 가끔 차이를 잘 느끼지 못한다.",
        "말투의 작은 변화에 가끔 너무 많은 의미를 부여하는 편이다."
      ]
    }
  },
  "grammar": {
    "A1-A2": {
      "strength": [
        "간단한 문장을 만들 수 있다.",
        "현재 시제를 비교적 정확하게 사용할 수 있다.",
        "기본적인 의문문을 사용할 수 있다.",
        "한국어의 기본 문장 구조와 어순에 맞게 자신의 하루 일과를 설명할 수 있다.",
        "기본적인 형용사를 사용할 수 있다.",
        "질문하는 문장을 스스로 만들 수 있다.",
        "기본 문형에 맞게 신분·상태·위치를 말할 수 있다(이다/있다/없다).",
        "일상적인 행동과 관련되어 자주 쓰는 동사를 활용할 수 있다.(먹다, 가다, 사다 등)",
        "능력·허가·조언을 나타내는 기본 표현을 쓸 수 있다. 예) V–(으)ㄹ 수 있다, V–아·어도 된다, V–는 게 좋다, A/V–아/어야 한다 등"
      ],
      "weakness": [
        "어순을 자연스럽게 배열하는 데 어려움이 있다.",
        "동사 형태 변화에서 실수가 잦다.",
        "문장에서 시간·장소·방향·대상 등의 관계를 나타내는 작은 문법 요소(조사 등)를 자연스럽게 쓰는 데 어려움이 있다.",
        "말하는 사람의 태도를 나타내는 조동사를 자주 생략한다. (예: ‘아/어/해 드리다’)",
        "복수형 사용이 아직 불안정하다.",
        "접속사 사용에 도움이 필요하다. (예: 그리고, 그런데, 그러면 등)",
        "현재 시제와 과거 시제를 헷갈려 하는 편이다.",
        "주어와 동사의 호응(일치)을 더 연습할 필요가 있다.",
        "여러 시제를 한 문장 안에서 함께 쓰는 데 어려움이 있다."
      ]
    },
    "B1-B2": {
      "strength": [
        "다양한 시제를 안정적으로 사용할 수 있다.",
        "문장을 자연스럽게 이어 구조가 잘 갖춰진 긴 문장을 만들 수 있다.",
        "상황에 맞게 수동 표현(열리다, 보이다 등)을 적절히 사용할 수 있다.",
        "간접화법(“~라고 말하다” 등)을 비교적 정확히 사용할 수 있다.",
        "여러 종류의 조건·가정 표현을 이해하고 적용할 수 있다. (예: A/V-(으)면, A-다면, V-는다면, N-(이)라면 등)",
        "‘-는 것’ ‘-기’ 같은 명사화 표현과 ‘-으려고’ 같은 목적·의도 표현을 의미에 맞게 구분해 쓸 수 있다.",
        "‘보다, 더/덜, 가장/제일’ 등 비교·정도 표현을 상황에 맞게 정확히 사용할 수 있다.",
        "공손한 요청과 간접의문문을 적절한 어조로 만들 수 있다. (예: “-는지 알려 주실 수 있어요?” 등)",
        "연결 표현을 활용해 말이나 글의 논리 전개를 매끄럽게 할 수 있다.",
        "관형사형 어미(-는/-(으)ㄴ/-(으)ㄹ 등)로 명사를 꾸미는 절을 적절히 만들어 문장을 자연스럽게 확장할 수 있다."
      ],
      "weakness": [
        "시제를 혼용하여 사용해서 시제의 일관성이 떨어질 때가 있다.",
        "더 복잡한 고급 가정·조건 표현을 사용할 때 어려움을 느낀다.",
        "주어–동사 일치에서 여전히 오류가 남아 있다.",
        "문법 정확도가 때때로 불안정하다.",
        "명사를 앞에서 꾸며 주는 절을 쓸 때 어순이나 구조가 어색해져 문장이 애매해질 때가 있다.",
        "동사 연어와 보조 용언 구문 사용 연습이 더 필요하다.",
        "지시어(이/그/저) 사용, 은/는·이/가 등 조사의 운용이 불안정하다.",
        "단순한 문장을 반복하여 사용하는 경향이 있다.",
        "문장에서 시간·장소·방향 등을 나타내는 조사를 가끔 빠뜨린다.",
        "격식/비격식 문법 구분이 어렵다."
      ]
    },
    "C1-C2": {
      "strength": [
        "고급 문형과 복잡한 문장 구조를 효과적으로 사용할 수 있다.",
        "여러 시제를 전반적으로 높은 정확도로 사용할 수 있다.",
        "도치 구조를 사용해 강조하거나 초점을 드러내는 표현을 정확히 쓸 수 있다.",
        "가능성·의무·추측 등을 나타내는 조동사류 표현으로 의미의 미묘한 차이를 잘 드러낼 수 있다.",
        "복잡한 관형절(관계절) 등, 명사를 앞에서 자세히 꾸미는 절 구조를 잘 이해하고 자연스럽게 사용할 수 있다.",
        "논리 전개를 보여 주는 고급 연결 표현을 말과 글에서 유창하게 사용할 수 있다.",
        "상황과 문장 유형에 상관없이 자연스럽고 올바른 어순을 유지할 수 있다.",
        "여러 종류의 절 구조와 문장 패턴을 골고루 사용해 표현을 풍부하게 만들 수 있다.",
        "상황에 맞게 격식 있는 말투와 편한 말투를 자연스럽게 오갈 수 있다.",
        "말을 빠르게, 유창하게 할 때에도 문법적인 정확도를 높은 수준으로 유지한다."
      ],
      "weakness": [
        "문장을 만들 때 구조를 필요 이상으로 복잡하게 만드는 경우가 있다.",
        "피동 표현을 필요 이상으로 자주 써서, 더 자연스러운 능동 표현을 충분히 활용하지 못할 때가 있다.",
        "좀 더 복잡한 고급 가정·조건문을 가끔은 자연스럽지 않게 사용하기도 한다.",
        "자주 쓰이지 않는 드문 문법 구조는 아직 더 정교하게 다듬고 연습할 필요가 있다.",
        "아주 격식 있는 문체를 쓸 때 표현이 다소 어색하거나 상황에 딱 맞지 않는 경우가 있다.",
        "편한 일상 대화에서도 지나치게 복잡하거나 문어적인 구조를 쓰는 경향이 있다.",
        "관용적이거나 굳어진 문법 표현의 미묘한 차이를 구분해 쓰는 데 어려움을 겪을 때가 있다.",
        "문법 선택을 지나치게 고민해서 오히려 말이 덜 자연스럽거나 흐름이 끊기는 경우가 있다.",
        "문법을 잘못 사용했을 때 스스로 바로 고치지 못하는 편이다.",
        "잘 쓰이지 않는 희귀한 문법 규칙을 사용할 때는 가끔 확신이 서지 않아 주저하는 모습이 보인다."
      ]
    }
  },
  "speaking": {
    "A1-A2": {
      "strength": [
        "간단한 대화에서는 뜻을 분명히 전달할 수 있다.",
        "간단한 자기소개를 할 수 있다.",
        "간단한 질문에 대답할 수 있다.",
        "자주 쓰는 쉬운 표현을 적절히 사용한다.",
        "간단한 말로 도움을 요청할 수 있다.",
        "익숙한 물건을 간단히 묘사할 수 있다.",
        "자신이 좋아하는 것과 싫어하는 것을 말할 수 있다.",
        "일상에서 익숙한 주제에 대해 이야기할 수 있다."
      ],
      "weakness": [
        "상황에 따라 말이 다소 전문적이거나 어렵게 들릴 때가 있다.",
        "설명을 지나치게 자세히 하여 말이 길어지는 경우가 있다.",
        "거의 망설이지 않지만, 아주 복잡한 질문에는 잠시 생각하는 시간이 필요하다.",
        "아주 복잡한 문장을 말할 때는 가끔 작은 문법 실수가 생긴다.",
        "일부 답변이나 문장 구조에 지나치게 완벽함을 추구하여, 필요 이상으로 신경 쓰는 경향이 있다.",
        "가끔은 필요 이상으로 복잡한 표현이나 구조를 사용할 때가 있다.",
        "말이 빨라지면 표현이 다소 덜 명확해질 때가 있다.",
        "설명을 너무 늘어놓다가 가끔은 주제에서 벗어나기도 한다."
      ]
    },
    "B1-B2": {
      "strength": [
        "비교적 긴 대화를 이어 갈 수 있다.",
        "이전보다 더 다양한 어휘를 사용해 표현한다.",
        "기본적인 개념을 분명하게 설명할 수 있다.",
        "질문에 대해 비교적 자세하게 대답할 수 있다.",
        "생각을 거친 후에는, 예상치 못한 질문에도 대응할 수 있다.",
        "개인 경험을 비교적 자연스럽게 말할 수 있다.",
        "간단한 토론이나 의견 교환에 참여할 수 있다.",
        "주요 내용을 대략 정리하여 말로 요약할 수 있다."
      ],
      "weakness": [
        "낯선 주제에서는 여전히 망설이는 편이다.",
        "추상적인 내용을 말할 때 표현이 다소 불분명할 때가 있다.",
        "알맞은 단어를 떠올리느라 말을 자주 멈추곤 한다.",
        "복잡한 문장 구조를 사용하는 데 어려움이 있다.",
        "준비가 안 된 상황에서 하는 대화는 말이 잘 안 이어질 때가 있다.",
        "같은 표현이나 단어를 가끔 반복한다.",
        "생각을 정리하고 구성하는 데 시간이 다소 필요한 편이다.",
        "어려운 주제에서도 단순한 표현만 반복해서 쓰는 편이다."
      ]
    },
    "C1-C2": {
      "strength": [
        "다양하고 복잡한 문장 구조를 능숙하게 활용할 수 있다.",
        "준비 없이도 즉석에서 자신의 생각을 비교적 분명하게 표현할 수 있다.",
        "폭넓은 주제에 대해 부담 없이 토론할 수 있다.",
        "말할 때 자신의 생각을 잘 정리하여 전체적인 흐름이 매우 분명하다.",
        "추상적이거나 복잡한 생각도 효과적으로 말로 표현할 수 있다.",
        "상대에 따라 말하는 스타일을 유연하게 조절할 수 있다.",
        "격식 있는 자리와 편한 자리 모두에서 자연스럽게 말할 수 있다.",
        "관용 표현과 구어체 표현도 비교적 자연스럽게 활용할 수 있다."
      ],
      "weakness": [
        "상황에 따라 말이 다소 전문적이거나 어렵게 들릴 때가 있다.",
        "설명을 지나치게 자세히 하여 말이 길어지는 경우가 있다.",
        "거의 망설이지 않지만, 아주 복잡한 질문에는 잠시 생각하는 시간이 필요하다.",
        "아주 복잡한 문장을 말할 때는 가끔 작은 문법 실수가 생긴다.",
        "일부 답변이나 문장 구조에 지나치게 완벽함을 추구하여, 필요 이상으로 신경 쓰는 경향이 있다.",
        "가끔은 필요 이상으로 복잡한 표현이나 구조를 사용할 때가 있다.",
        "말이 빨라지면 표현이 다소 덜 명확해질 때가 있다.",
        "설명을 너무 늘어놓다가 가끔은 주제에서 벗어나기도 한다."
      ]
    }
  },
  "accuracy": {
    "A1-A2": {
      "strength": [
        "기초적인 문법 구조를 어느 정도 정확하게 사용할 수 있다.",
        "주어–목적어–동사 형태의 단순한 문장을 만들 수 있다.",
        "현재 시제를 비교적 정확하게 쓰는 편이다.",
        "기본적인 인칭대명사를 어느 정도 일관되게 사용할 수 있다.",
        "자신의 실수를 알아차리면 스스로 고치려고 노력하는 편이다.",
        "아주 간단한 오류는 스스로 고칠 때가 있다.",
        "기본적인 어순에 대한 인식이 점점 생기고 있다.",
        "제시된 예문을 따라 쓰면 전체적으로 비교적 정확하게 쓸 수 있다."
      ],
      "weakness": [
        "간단한 문장에서도 문법 실수가 자주 보인다.",
        "오류 때문에 전달하려는 의미가 불분명해지는 경우가 있다.",
        "과거·미래 시제 사용에 어려움을 겪는다.",
        "문장에서 조사나 그 밖의 작은 문법 요소를 자주 빼먹거나 잘못 사용한다. (예: 은/는, 이/가, 을/를, 에/에서 등）",
        "단·복수 형태를 정확히 구분하지 못할 때가 많다.",
        "모국어 어순의 영향을 받아 어순이 어색하게 느껴지는 경우가 많다.",
        "반복되는 오류를 알아차리고 수정하는 데 도움이 필요하다.",
        "기본 단어에서도 철자 실수가 자주 보인다."
      ]
    },
    "B1-B2": {
      "strength": [
        "익숙한 문법 패턴에서는 전반적으로 비교적 정확하게 말하고 쓸 수 있다.",
        "과거·현재·미래와 같은 시간 표현을 대체로 알맞게 쓸 수 있다.",
        "실수가 있어도 보통 의사소통에 큰 지장을 주지는 않는다.",
        "시간 여유가 있으면 스스로 다시 확인하며 오류를 고치려고 하는 편이다.",
        "나열·대조·이유 등을 나타내는 기본 접속 표현을 사용해 문장과 생각을 비교적 정확하게 이어 갈 수 있다.",
        "스스로 자주 하는 실수를 인식하고, 그런 실수를 피하려고 적극적으로 노력한다.",
        "여러 상황에서 명사·동사·형용사 등의 형태나 쓰임을 비교적 정확하게 고를 수 있다.",
        "자주 쓰는 단어의 표기는 대부분 정확하다."
      ],
      "weakness": [
        "복잡한 시제나 문법 구조를 사용할 때는 아직도 실수가 자주 보인다.",
        "시간·장소·문장 안의 관계를 나타내는 조사나 접속 표현 등 작은 문법 요소 사용에서 자주 실수를 한다.",
        "문장이 길어지면 어순이 뒤섞이거나 어색해지는 경우가 있다.",
        "말하거나 쓸 때 속도가 빨라지면 문법 정확도가 눈에 띄게 떨어지는 경향이 있다.",
        "특정 문법 오류가 지금도 습관처럼 반복해서 나타난다.",
        "미래 등 시간을 나타낼 때 쓰는 비슷한 문법 패턴을 가끔씩 혼동한다.",
        "더 정확하고 미세한 문법 형태를 적절하게 사용하려면 여전히 강사의 지도가 필요하다.",
        "복잡한 문장을 만들 때는 눈에 띄는 문법 실수가 한두 개씩 들어가는 경우가 많다."
      ]
    },
    "C1-C2": {
      "strength": [
        "전반적으로 매우 높은 문법적 정확도를 유지한다.",
        "실수가 있더라도 드물고, 대부분 사소한 수준에 그친다.",
        "여러 가지 복잡한 문장 구조도 안정적으로 사용할 수 있다.",
        "상황에 맞게 시제와 상(예: 진행, 완료 등)을 적절히 선택할 수 있다.",
        "덜 익숙한 어휘를 사용할 때도 단어 형태를 대체로 정확하게 고른다.",
        "철자나 표기가 거의 항상 정확하다.",
        "미묘한 실수도 스스로 알아차리고 고칠 수 있다.",
        "상황과 말의 격식(공식적/비공식적)에 따라 정확도와 표현 방식을 조절할 수 있다."
      ],
      "weakness": [
        "아주 복잡하거나 거의 쓰이지 않는 문장 구조에서는 가끔 실수가 나타날 수 있다.",
        "문장에서 생각을 이어 주거나 시간·방향·관계를 나타내는 조사·접속 표현 같은 작은 문법 요소에서 아주 사소한 오류가 가끔 보인다.",
        "단순한 상황에도 문장을 지나치게 복잡하게 만드는 경우가 있다.",
        "매우 고급스러운 관용 표현 사용에는 여전히 약간의 불확실함이 남아 있을 수 있다.",
        "문장이 아주 길어지면 드물게 호응이나 일치 오류가 나타날 수 있다.",
        "아주 형식적인 글이나 발표에서는 표현을 더 다듬을 여지가 있다.",
        "시간 압박이 심할 때는 “이 정도면 됐다”라고 판단하고 세부적인 정확도를 일부 포기할 때가 있다.",
        "미묘하고 복잡한 문장 구조를 항상 일관되게 정확하게 쓰려면, 아직은 조금 더 정교한 훈련이 필요하다."
      ]
    }
  }
}