{
  "pronunciation": {
    "A1-A2": {
      "strength": [
        "よく使う単語をわりとはっきり発音できる",
        "簡単な文の中で、大事な単語にアクセントを置くことができる。",
        "基本的な母音の発音はおおむね正しい。",
        "基本的なイントネーションの上がり下がりを聞き分けて、ある程度まねできる。",
        "濁音の有無はだいたい聞き分けられる。",
        "能相當準確地跟讀生字或生詞。",
        "只要專注聽，就能模仿老師的發音。",
        "自分の発音ミスに気づいたとき、直そうとする姿勢がある。"
      ],
      "weakness": [
        "聞き慣れない音は、うまく発音しにくい。",
        "単語のアクセントの位置を間違えることが多い。",
        "「ち」や「つ」、濁音や拗音の発音が安定しにくい。",
        "イントネーションの変化がまだ少なく、平坦になりがちだ。",
        "長い単語は、ときどき発音を間違えやすい。",
        "話すスピードがやや遅く、ためらいが目立つことがある。",
        "単語同士がつながるときの音やアクセントの変化をつかみにくい。（例:大学↑、東京大学↓）",
        "単語の末尾が曖昧になったり、抜けてしまったりすることがある。"
      ]
    },
    "B1-B2": {
      "strength": [
        "ほとんどの単語をはっきり発音できる。",
        "必要に応じて、聞き手に伝わるよう発音を調整できる。",
        "よく使われる単語のアクセントパターンを理解し、使えるようになっている。",
        "文末でのイントネーションの上げ下げを適切に使える。（例:そうですか。↓、そうですか？↑）",
        "文の中で音を自然につなげて発音し、流れを作ることができる。",
        "文全体のリズムや間の取り方について、基本的な感覚が身についている。",
        "多くの聞き手にとって、発音はおおむね聞き取りやすい。",
        "自分の発音ミスに気づいたとき、言い直すことができる。"
      ],
      "weakness": [
        "長めで複雑な単語は、ときどき発音を間違えることがある。",
        "文の中で、どの語にアクセントを置くかが不自然になることがある。",
        "速く話しすぎて、発音が不明瞭になることがある。",
        "速く話すとき、発音が安定しにくい。",
        "単語の末尾の音を忘れてしまったり、弱くしすぎたりすることがある。",
        "単語同士をつないで話すと、不自然に聞こえることがある。",
        "テンポの速い会話では、まだ滑らかさに課題がある。",
        "特定のアクセントや訛りの場合、聞き取り・真似が難しいことがある。"
      ]
    },
    "C1-C2": {
      "strength": [
        "全体として、発音はネイティブスピーカーにかなり近い。",
        "アクセントやイントネーションをうまく使って意味や感情を表せる。",
        "複雑な単語でも、はっきり発音できることが多い。",
        "フォーマルかカジュアルかに合わせて、話し方の発音を切り替えられる。",
        "音の細かな違いを聞き分ける力が高い。",
        "短縮形（〜てる、〜ちゃう、〜とく）や弱くなる音（例:「〜です」の\"す\"）を自然に使いこなせる。",
        "議論の中で、必要に応じて発音を調整し、分かりやすく話すことができる。",
        "母語話者に近いリズムや話す流れを再現することができる.",
        "さまざまな日本語のアクセントにも、おおむね対応できる。",
        "どのような場面でも、自然で滑らかな発音で話すことができる。"
      ],
      "weakness": [
        "ときどき、不自然に聞こえるアクセントで話してしまうことがある。",
        "一部の音節にアクセントを置きすぎてしまうことがある。",
        "あまり使われない特殊な音（外来語など）は、ときどき安定して発音できないことがある。",
        "単語によっては、発音が大袈裟に聞こえることがある。",
        "非常に速い話し方の中の細かな音の違いを、正確にとらえきれないことがある。",
        "普段の発音に問題はほとんどないが、固有名詞や外来語では少し迷うことがある。",
        "自分の発音を直そうとして、かえって流れを止めてしまうことがある。",
        "発音を完璧にしようとしすぎて、かえって自然さを失うことがある。",
        "あまり聞き慣れないアクセントには、慣れるまで少し時間がかかることがある。",
        "専門用語のアクセントの位置を、ときどき誤ってしまうことがある。"
      ]
    }
  },
  "vocabulary": {
    "A1-A2": {
      "strength": [
        "日常的な話題について基本的な語彙を使用できる",
        "よく使われる単語を理解し適切に使うことができる",
        "身近な物事や活動を簡単な語で表現できる",
        "指導があれば語を思い出して使用できる",
        "基本的な動詞や名詞の組み合わせを使える",
        "授業中に新しい単語を積極的に使おうとしている",
        "反意語や類義語の基本的な理解がある",
        "簡単な形容詞で考えを補足できる"
      ],
      "weakness": [
        "自分の考えを表現するための語彙の幅が限られている。",
        "適切な言葉を思い出すために、助けが必要なことが多い。",
        "話しているときに単語がなかなか思い出せないことが多い。",
        "同義語や似た意味の語を使い分けることが難しい。",
        "同じ単語を繰り返し使ってしまうことが多い。",
        "抽象的な概念や感情をうまく言葉で表現できない。",
        "あまり知らない話題については、語彙が足りず説明しにくい.",
        "会話の中で、より正確で多様な語彙がまだ必要である."
      ]
    },
    "B1-B2": {
      "strength": [
        "自分の意見を、適切な語彙を使ってはっきり表現できる。",
        "少し準備すれば、身近な概念について説明することができる。",
        "よく使われる慣用句のいくつかを理解し、使うことができる。",
        "自分の経験について、ある程度詳しく説明できる。",
        "形容詞や副詞を使って、表現に細かいニュアンスを加えられる。",
        "なじみのある話題の多くについては、無理なく会話できる。",
        "サポートがあれば、あまりなじみのない話題についても話すことができる。",
        "自分の経験や今後の計画について話すことができる。"
      ],
      "weakness": [
        "細かなニュアンスや専門的な語彙についてはまだ足りない部分がある。",
        "複雑な考えを表すのに、ちょうどいい言葉がなかなか出てこないことがある。",
        "特定の状況で必要となる語彙が十分でないことがある。",
        "話している最中に、使いたい単語がすぐ思い出せないことがある。",
        "単語の組み合わせ（例：宿題をする⚪︎書く×）や定型表現の使い方にまだ課題がある。",
        "より高度で自然な語彙に触れる機会と蓄積がさらに必要である。",
        "複雑な話題になると、同じ言葉を繰り返してしまうことがある。",
        "専門的・フォーマルな場面でも、まだ基本的な語彙に頼りがちである。"
      ]
    },
    "C1-C2": {
      "strength": [
        "複雑な話題についても、非常に幅広い語彙を持っている。",
        "自分の考えや意見を細かいニュアンスまで表現できる。",
        "慣用句や口語的な言い回しも自然に使いこなせる。",
        "状況や相手に合わせて語彙の使い方を柔軟に変えることができる。",
        "高度な形容詞や副詞を使って、表現を豊かにすることができる。",
        "抽象的な概念についても流暢に説明することができる。",
        "自分の立場や考えを、正確な語彙で表現できる。",
        "自然な単語の組み合わせが使用できる。（例:宿題をする⚪︎書く×）",
        "学術的・フォーマルな場面でも適切な言葉遣いができる。",
        "幅広い分野の話題について、無理なく会話を続けることができる。"
      ],
      "weakness": [
        "文脈に合わない単語を稀に選んでしまうことがある。",
        "表現が必要以上に複雑になってしまうことがある。",
        "専門分野で使われる専門用語については、まだ伸びしろがある。",
        "非常に高度な専門用語については、意味や用法に迷うことがある。",
        "誤りは少ないものの、語彙がやや単調に感じられることがある。",
        "複雑な語彙をたまに誤った形で使ってしまうことがある。",
        "日常的な会話で、必要以上に細かい表現をしてしまうことがある。",
        "高度な学術的・専門的話題については、さらに正確さを高める余地がある。",
        "あまり見かけない語彙の使い方について、迷うことがある。",
        "場面に比べて、ややフォーマルすぎる表現を使ってしまうことがある。"
      ]
    }
  },
  "listening": {
    "A1-A2": {
      "strength": [
        "日常的によく使われる言い回しを聞いて理解できる。",
        "ゆっくりはっきり話してもらえれば、おおむね聞き取れる。",
        "文脈の中で聞き慣れた単語を聞き分けることができる。",
        "基本的なあいさつや簡単な質問を聞いて理解できる。",
        "授業中の簡単な指示がおおむね聞き取れる。",
        "短くて簡単な文を聞いて理解できる。",
        "聞きながら、要点となるキーワードを拾うことができる。",
        "簡単な依頼の表現を聞いて理解できる。",
        "はい／いいえで答える基本的な質問を聞いて理解できる。"
      ],
      "weakness": [
        "相手に何度か繰り返し話してもらわないと理解するのが難しい。",
        "少し速い自然な話し方になると、内容を追うことができない。",
        "長めの会話では、細かい部分を聞き落としがちだ。",
        "ふだんと違うアクセントや訛りは聞き取りにくい。",
        "絵やジェスチャーなどの視覚的な手がかりがあると、理解しやすい。",
        "一部は聞き取れても、全体の意味まではつかみきれないことがある。",
        "音がつながったり省かれたりする話し方は聞き取りにくい。",
        "聞いた内容を理解するのに、少し時間がかかる。"
      ]
    },
    "B1-B2": {
      "strength": [
        "日常的な内容の会話なら、話の大まかな内容をつかむことができる。",
        "なじみのある話題なら、普通の速さでもだいたいついていける。",
        "カジュアルな会話では、話し手のおおよその意図をつかむことができる。",
        "フォーマルな話し方とくだけた話し方の違いを聞き分けられる。",
        "構成が分かりやすい、比較的簡単なストーリーなら理解できる。",
        "注意して聞けば、基本的な説明や解説を理解できる。",
        "やや長めの話でも、主なポイントを聞き取ることができる。",
        "日常のさまざまな場面において、相手の話を聞き取ることができる。",
        "アナウンスや案内などの内容をおおむね理解できる。"
      ],
      "weakness": [
        "言外の意味をくみ取るのが難しいことがある。",
        "慣用句やネイティブの自然な話し方に触れる機会がまだ足りない。",
        "内容が込み入った議論では、ときどき誤解してしまうことがある。",
        "訛りや方言が強い話し方は聞き取りにくい。",
        "テンポの速い議論には、ついていけないことが多い。",
        "専門的・技術的な話題では、説明を補ってもらうことが多い。",
        "話題が少しずつ変わるとき、その変化に気づきにくいことがある。",
        "ユーモアや皮肉を含む言い方を、ときどきうまく理解できない。",
        "スピードが速く、くだけた言い方や俗語が多い話し方は理解しづらい."
      ]
    },
    "C1-C2": {
      "strength": [
        "母語話者が自然にやや速く話しても、おおむね聞き取ることができる。",
        "話し手の声のトーンの細かな変化を聞き分けることができる。",
        "言外の意味やニュアンスの違いを理解することができる。",
        "ニュースや講義、一般的なディスカッションにも無理なくついていける。",
        "ユーモアや皮肉、風刺を含む表現も聞いて理解できる。",
        "複数人で行われる討論やパネルディスカッションの内容も理解できる。",
        "複雑な学術的・専門的内容でも、筋を追って理解できる。",
        "周囲に雑音があっても、会話の内容をおおむね聞き取ることができる。",
        "フォーマルな話し方とくだけた話し方のどちらにも慣れていて、どちらも理解しやすい。",
        "声の抑揚やイントネーションから、感情や態度を読み取ることができる。"
      ],
      "weakness": [
        "訛りが非常に強い話し方は、ときどき聞き取りにくい。",
        "文化的な前提に依存した言及は、ときどき理解できない。",
        "意味を考えすぎてしまい、かえって理解が複雑になることがある。",
        "高度で専門的な用語が多い内容は、今も理解しづらいことがある。",
        "複数人が同時に話す場面では、ときどき内容を追いにくい。",
        "聞き慣れない方言には、少し慣れる時間が必要になる。",
        "非常に抽象的な哲学的議論は、今も理解しづらい。",
        "相手があえて曖昧に表現したとき、ときどき違う意味で受け取ってしまう。",
        "慣用句の細かなバリエーションの違いに気づけないことがある。",
        "声のトーンの小さな変化を、ときどき深く読み取りすぎてしまう。"
      ]
    }
  },
  "grammar": {
    "A1-A2": {
      "strength": [
        "簡単な文を作ることができる。",
        "現在形を正確に使うことができる。",
        "基本的な疑問文が使える。",
        "基本的な構文で生活の習慣を説明できる。",
        "基本的な形容詞を使える。",
        "疑問文を作ることができる。",
        "基本的な文型で身分・状態・場所を言える（です／います・あります）。",
        "日常的な行動に関するよく使う動詞（食べる・行く・買うなど）を活用できる。",
        "能力・助言の基本表現が使える（〜ことができる／〜てもよい／〜たほうがいい・〜べき など）。"
      ],
      "weakness": [
        "語順を間違えることが多い。",
        "動詞の時制や助詞などを間違えることが多い。",
        "時間・場所・方向・相手などの関係を表す助詞の使い方に課題がある。",
        "時制や話し手の気持ちを表す形容詞を省略してしまうことが多い。",
        "助数詞や数字の読み方（一つ、一歳、四月、四時など）が安定していない。",
        "接続詞の使い方についてサポートが必要である。",
        "現在形と過去形を混同しやすい。",
        "動作の主語が誰なのか分かりにくいことがあり、もっと練習する必要がある。",
        "複数の時制を組み合わせて使うことが難しい。"
      ]
    },
    "B1-B2": {
      "strength": [
        "多様な時制を安定して使える。",
        "文をうまくつなぎ、自然に長い文を作ることができる。",
        "状況に応じて受け身（受動態）を適切に使うことができる。",
        "間接話法（例:〜と言いました）を正確に用いることができる。",
        "さまざまな条件文（例:〜たら、〜れば、〜なら）を理解し、適切に使うことができる。",
        "文法に応じて、動作の名詞化が使い分けられる（例:〜することができる／〜したことがある）。",
        "「A は B より〜」「もっと〜」「いちばん〜」「B ほど〜ない」「B と同じくらい〜」などの比較・程度表現を文脈に合わせて正確に使える。",
        "丁寧な依頼表現や間接疑問文（例:彼がどこにいるかわからない、宿題があるかどうか教えて等）を作ることができる。",
        "接続詞を使って、文章や会話の論理の流れを分かりやすくできる。",
        "連体修飾節を適切に作り、文を簡潔に広げることができる。（例:私が作ったケーキ、母が住んでいる町、市役所へ行く時間など）"
      ],
      "weakness": [
        "時制を混同して使ってしまうことがある。",
        "高度で複雑な条件文（〜たら、〜れば）は難しく感じる。",
        "主語と動詞が一致しないことがある。",
        "文法の正確さが時折安定しない。",
        "連体修飾節のつなぎ方や、どの名詞を修飾しているかの関係を誤ることがある。",
        "複合動詞・助動詞（〜ていく／〜てくる／〜てしまう 等）や決まった単語の組み合わせの定着が不十分。",
        "指示詞（この／その／あの）の使用と、助詞（は・が）などの運用が不安定である。",
        "単純な文型を使いすぎることがある。",
        "句やフレーズの中で、時間・場所・方向などを表す助詞を抜かしてしまうことがある。",
        "フォーマル／インフォーマルの文体区別が難しい。"
      ]
    },
    "C1-C2": {
      "strength": [
        "高度な文型や複雑な構文を効果的に使うことができる。",
        "あらゆる時制を、全体的に高い正確さで使うことができる。",
        "語順を入れ替えたり、倒置法や体言止めを使って、焦点や強調をうまく示すことができる。",
        "可能性・義務・推量などを表す助動詞を使って、意味の細かな違いを表現できる。",
        "複雑な関係節において、名詞の前に修飾語を置く構造を理解し、自然に使うことができる。",
        "高度な接続表現を、会話や文章の中で流暢に使うことができる。",
        "さまざまな場面、文型でも、自然で正しい語順を保つことができる。",
        "多様な文型を使い分けて、表現にバリエーションを持たせられる。",
        "フォーマルな言い方とカジュアルな言い方を、場面に合わせて自在に切り替えられる。",
        "速く流暢に話していても、文法の正確さを高いレベルで保つことができる。"
      ],
      "weakness": [
        "文を組み立てるとき、構造を必要以上に複雑にしてしまうことがある。",
        "受け身表現を使いすぎて、自然な能動表現を使えないことがある。",
        "高度で複雑な条件文（仮定表現）を、ときどき不自然な形で使ってしまうことがある。",
        "あまり使われない特殊な文法の使い方について、さらに細かな調整と練習が必要である。",
        "きわめてフォーマルな文体を使う場面で、表現がやや不自然になったり、場面に合わなかったりすることがある。",
        "カジュアルな会話でも、文語的で複雑な構文を使いすぎてしまうことがある。",
        "単語の決まった組み合わせの細かな違いを使い分けるのが難しいことがある。（例:気をつける、気になる、気にする など）",
        "文法を意識しすぎて、かえって話し方がぎこちなくなったり流れが悪くなったりすることがある。",
        "文法を間違えたとき、自分ですぐに修正することができない。",
        "あまり見かけない文法を使う場面では、自信が持てずに迷うことがある。"
      ]
    }
  },
  "speaking": {
    "A1-A2": {
      "strength": [
        "簡単な会話なら要点をはっきり伝えられる。",
        "簡単な自己紹介をすることができる。",
        "簡単な質問には答えることができる。",
        "よく使う定型表現を使える。",
        "基本的な手助けが必要なとき、簡単な文章で頼むことができる。（注文など）",
        "身近な物について簡単に説明できる。",
        "自分の好き嫌いを表現することができる。",
        "日常生活でなじみのある話題について話すことができる。"
      ],
      "weakness": [
        "状況によっては、言葉遣いが専門的すぎる印象になることがある。",
        "説明が細かくなりすぎて、話が長くなってしまうことがある。",
        "ほとんど迷うことはないが、非常に難しい内容では少し考え込むことがある。",
        "高度に複雑な文法構造では、わずかな誤りが生じることがある。",
        "一部の答え方や構文について、完璧さを気にしすぎることがある。",
        "ときどき、必要以上に難しい表現や構造を使ってしまうことがある。",
        "話すスピードが速くなると、やや分かりにくくなることがある。",
        "説明をしすぎて話がそれてしまうことがときどきある。"
      ]
    },
    "B1-B2": {
      "strength": [
        "比較的長い会話にも参加できる。",
        "以前より幅広い語彙で表現できる。",
        "基本的な概念を分かりやすく説明できる。",
        "質問に対して、ある程度詳しく答えることができる。",
        "工夫すれば不意の質問にも対応できる。",
        "自分の経験を自然に語ることができる。",
        "簡単な議論や意見交換に参加することができる。",
        "要点をおおまかに整理して口頭でまとめることができる。"
      ],
      "weakness": [
        "なじみのない話題ではまだ迷うことが多い。",
        "抽象的な内容ついて話す際、不明瞭になることがある。",
        "言葉を探して考え込むために、話がよく途切れてしまう。",
        "複雑な文構造の運用にまだ苦労する。",
        "即興の会話では流暢さが足りないことがある。",
        "同じ表現や単語を時々繰り返してしまう。",
        "自分の考えをまとめて整理するのに、ある程度時間が必要である。",
        "複雑な場面でも単純な言い回しに頼ることがある。"
      ]
    },
    "C1-C2": {
      "strength": [
        "多様で複雑な文構造を自在に使いこなすことができる。",
        "準備がなくても、その場で自分の考えをはっきり伝えることができる。",
        "幅広い話題について、自信を持って話し合うことができる。",
        "話すときの考えの組み立てが、全体的にとても明確である。",
        "抽象的・複雑な内容も効果的に言葉で表現できる。",
        "聞き手に合わせて話し方やスタイルを柔軟に変えることができる。",
        "フォーマルな場面でもインフォーマルな場面でも、自然に話すことができる。",
        "慣用表現や口語的な言い回しも無理なく使いこなせる。"
      ],
      "weakness": [
        "状況によっては、言葉遣いが専門的すぎる印象になることがある。",
        "説明が細かくなりすぎて、話が長くなってしまうことがある。",
        "ほとんど迷うことはないが、非常に難しい内容では少し考え込むことがある。",
        "高度に複雑な文法構造では、わずかな誤りが生じることがある。",
        "一部の答え方や構文について、完璧さを気にしすぎることがある。",
        "ときどき、必要以上に難しい表現や構造を使ってしまうことがある。",
        "話すスピードが速くなると、やや分かりにくくなることがある。",
        "説明をしすぎて話がそれてしまうことがときどきある。"
      ]
    }
  },
  "accuracy": {
    "A1-A2": {
      "strength": [
        "基本的な文法構造をある程度正しく使うことができる。",
        "主語–目的語–動詞の形の簡単な文を作ることができる。",
        "現在形を比較的正確に使えている。",
        "基本的な人称代名詞をある程度一貫して使うことができる。",
        "自分の誤りに気づくと直そうと努力する。",
        "ごく簡単なミスであれば自分で直すことがある。",
        "基本的な語順に対する意識が少しずつ育ってきている。",
        "例文をまねて書けば、比較的正確な文を書くことができる。"
      ],
      "weakness": [
        "簡単な文の中でも文法的な誤りがよく見られる。",
        "誤りのために、言いたいことがはっきり伝わらないことがある。",
        "過去形や未来表現の使用に苦労している。",
        "文中で、助詞などの小さな文法要素をよく忘れたり、誤って使ったりする。",
        "数字の読み方のパターンや助数詞をまだ正確に覚えられていない。",
        "母語の語順の影響で、語順が不自然になることが多い。",
        "何度も繰り返すミスに気づいて直すには、サポートが必要である。",
        "基本的な単語でも書き間違いが多い。"
      ]
    },
    "B1-B2": {
      "strength": [
        "慣れている文法パターンでは、比較的正確に話したり書いたりできる。",
        "過去・現在・未来といった時間を表す形を、ある程度コントロールして使うことができる。",
        "間違いがあっても、コミュニケーションに大きな支障が出ることはあまりない。",
        "時間があれば、自分で見直して誤りを直そうとする傾向がある。",
        "並列・逆接・原因などを表す基本的な接続詞を使って、考えや文を比較的正確につなげることができる。",
        "自分がよくしてしまう誤りを自覚し、それを避けようと積極的に取り組んでいる。",
        "多くの場面で、名詞・動詞・形容詞などの形や使い分けを正しく選んで使うことができる。",
        "よく使う語彙の表記は、ほとんど正確である。"
      ],
      "weakness": [
        "複雑な時制や文法構造を使う場面では、いまだに誤りがよく見られる。",
        "時間・場所・文中の関係などを示す前置詞や助詞といった、小さな文法要素の使い方をよく間違える。",
        "文が長くなると、語順が乱れたり不自然になったりすることがある。",
        "話したり書いたりするスピードが上がると、文法の正確さが目に見えて下がりがちである。",
        "特定の文法誤りが、今でもクセのように繰り返し現れる。",
        "未来などの時間を表す似たような文法パターンを、ときどき混同してしまう。",
        "より正確で細かな文法形式を適切に使うためには、依然として教師のサポートが必要である。",
        "複雑な文や複文を作るときには、目立つ文法ミスが一つ二つ入りやすい。"
      ]
    },
    "C1-C2": {
      "strength": [
        "全体として、文法の正確さは非常に高い水準を保っている。",
        "誤りがあってもごくまれで、多くはごく小さなレベルにとどまっている。",
        "さまざまな複雑な文構造も、安定して使うことができる。",
        "状況に応じて、時制やアスペクト（進行・完了など）を適切に選ぶことができる。",
        "あまり慣れていない語彙を使うときでも、語形の選び方は概ね正確である。",
        "文章を書く際、表記はほとんどいつも正しい。",
        "細かいミスにも自分で気づき、修正することができる。",
        "TPO（フォーマル／インフォーマル）に応じて、正確さや表現の仕方を調整できる。"
      ],
      "weakness": [
        "非常に複雑、あるいはあまり使われない構文では、ときどき誤りが出ることがある。",
        "接続詞や助詞、副詞などに、ときどきごく小さなミスが見られる。",
        "状況が簡単なときでも、文を必要以上に複雑にしてしまうことがある。",
        "非常に高度な慣用句を使う際には、まだ多少の不安が残ることがある。",
        "文が非常に長くなると、ごくまれに文章中の時制などに違和感が生じ、一貫性がなくなる。",
        "非常にフォーマルな文章や発表では、表現をさらに洗練できる余地がある。",
        "時間的なプレッシャーが強いと、「このくらいでいい」と判断して細部の正確さを一部諦めることがある。",
        "微妙なニュアンスの違いがある複雑な文型を、いつも正確に使うためには、なお一層きめ細かなトレーニングが必要である。"
      ]
    }
  }
}