{
  "pronunciation": {
    "A1-A2": {
      "strength": [
        "基本的な英語の音を明瞭に発音できる",
        "簡単な単語や文のイントネーションを模倣できる",
        "ゆっくりとしたスピードで明確に話すことができる",
        "母音と子音の基本的な区別ができる",
        "よく使う単語のストレス位置を正しく発音できる",
        "練習を通して発音の正確さが向上している",
        "教師の指導を受けて発音を修正できる",
        "短い文で一定のリズムを保つことができる"
      ],
      "weakness": [
        "一部の音が不明瞭または混同される",
        "ストレスとイントネーションが安定していない",
        "リエゾンや弱形の認識が不十分",
        "話す速度が遅く、不自然な間がある",
        "文末のイントネーションが一定でない",
        "教師の手本が必要な場面が多い",
        "新しい語の発音に時間がかかる",
        "母語の影響が発音に見られる"
      ]
    },
    "B1-B2": {
      "strength": [
        "全体的に明瞭で理解しやすい発音である",
        "ストレスとイントネーションの使用が概ね適切である",
        "状況に応じて話す速度を調整できる",
        "複雑な音節の発音が可能である",
        "発音の癖が理解を妨げない",
        "自然な話し方とリズムを維持できる",
        "朗読やプレゼンで自然なイントネーションを使用できる",
        "自分の発音の誤りを意識して修正できる"
      ],
      "weakness": [
        "長母音と短母音の区別に誤りがある場合がある",
        "単語のストレス位置が不正確なことがある",
        "イントネーションの変化が不自然に感じられることがある",
        "速い会話では明瞭さがやや低下する",
        "特定の単語で発音のばらつきが見られる",
        "母語アクセントが依然として残っている",
        "強弱のリズムに不安定さがある",
        "自然なイントネーションの使い分けが課題である"
      ]
    },
    "C1-C2": {
      "strength": [
        "発音が非常に明瞭で、母語話者に近い自然さがある",
        "イントネーションとリズムを適切に使い分けている",
        "文脈に応じて音調を柔軟に調整できる",
        "連音や弱形の使用が自然である",
        "リズムとスピードのバランスが取れている",
        "語彙や状況に応じて発音を意識的に変えられる",
        "聞き取りやすく自信のある発声である",
        "発音全体に安定感と一貫性がある"
      ],
      "weakness": [
        "専門用語の発音にばらつきがある場合がある",
        "過度に母語話者的なイントネーションになることがある",
        "緊張時に発話の抑揚が硬くなる傾向がある",
        "まれにストレス配置が不正確なことがある",
        "長い発話でイントネーションの変化が単調になることがある",
        "微妙な音の差異を再現する際に精度が落ちることがある",
        "やや形式的に聞こえる場面がある",
        "細かい発音の一貫性をさらに高める必要がある"
      ]
    }
  },
  "vocabulary": {
    "A1-A2": {
      "strength": [
        "日常的な話題について基本的な語彙を使用できる",
        "よく使われる単語を理解し適切に使うことができる",
        "身近な物事や活動を簡単な語で表現できる",
        "指導があれば語を思い出して使用できる",
        "基本的な動詞や名詞の組み合わせを使える",
        "授業中に新しい単語を積極的に使おうとしている",
        "反意語や類義語の基本的な理解がある",
        "簡単な形容詞で考えを補足できる"
      ],
      "weakness": [
        "語彙の範囲が限られており表現が単調になりやすい",
        "抽象的な話題の語彙が不足している",
        "単語の記憶に教師の支援を必要とすることが多い",
        "同じ単語を繰り返し使う傾向がある",
        "語の組み合わせに不自然さがある",
        "新しい語彙を会話で応用するのが難しい",
        "スペリングや語形変化に誤りがある",
        "不慣れな話題で語彙が不足する"
      ]
    },
    "B1-B2": {
      "strength": [
        "広い範囲の語彙を用いて意見を述べることができる",
        "文脈に応じて適切な語を選択できる",
        "自然なコロケーションを使用できる",
        "類義語を使い分けることができる",
        "一部の慣用表現を使いこなしている",
        "経験や意見を豊かな語彙で表現できる",
        "フォーマルとインフォーマルの語を区別できる",
        "さまざまなトピックに関連する語彙を使える"
      ],
      "weakness": [
        "抽象的・専門的なトピックでは語彙が不足する",
        "専門用語の使い方が不正確な場合がある",
        "一部の抽象語を誤用する傾向がある",
        "平易な語に頼りがちである",
        "コロケーションの自然さにばらつきがある",
        "語の選択が口語的になりすぎることがある",
        "長い発話で語の繰り返しが見られる",
        "より深い語彙の拡充が必要である"
      ]
    },
    "C1-C2": {
      "strength": [
        "非常に広い語彙範囲を持ち多様な話題に対応できる",
        "微妙な意味の違いを語彙で正確に表現できる",
        "自然にコロケーションや慣用表現を使える",
        "状況に応じて語のレジスターを切り替えられる",
        "比喩的・抽象的な語彙も使いこなせる",
        "語用・語感の違いを意識して使える",
        "学術的・専門的な語彙を適切に使える",
        "語のニュアンスを的確に使い分けている"
      ],
      "weakness": [
        "特定分野の語彙にはさらなる精度が必要",
        "一部の語がややフォーマルすぎることがある",
        "複合語の使い方に不自然さが見られることがある",
        "高度なコロケーションの安定性に課題がある",
        "抽象語の多用により意味が不明確になる場合がある",
        "即興発話時に語の選択が硬くなる傾向がある",
        "一部の語の語感に母語の影響が見られる",
        "自然な慣用句の使い方をさらに強化する必要がある"
      ]
    }
  },
  "listening": {
    "A1-A2": {
      "strength": [
        "簡単なあいさつや指示を理解できる",
        "身近な話題に関するキーワードを聞き取れる",
        "基本的なイントネーションや感情の違いを認識できる",
        "教師の明瞭な説明を理解できる",
        "短い指示に従うことができる",
        "文脈から意味を推測する力がある",
        "ゆっくりとしたスピードの会話を理解できる",
        "短い日常会話を聞き取ることができる"
      ],
      "weakness": [
        "詳細を理解するために繰り返しが必要である",
        "不慣れな話題では理解が難しい",
        "速いスピードの音声に対応できない",
        "似た音の単語を区別するのが難しい",
        "表情やジェスチャーに頼ることが多い",
        "異なるアクセントへの対応が弱い",
        "未知語に出会うと理解が止まりやすい",
        "長い文や会話に集中し続けるのが難しい"
      ]
    },
    "B1-B2": {
      "strength": [
        "日常的な会話の大部分を理解できる",
        "要点を的確に把握できる",
        "話し手の意図をイントネーションから推測できる",
        "やや長い文や段落も理解できる",
        "身近な話題では細部まで理解できる",
        "話し手の感情や態度を聞き取れる",
        "自然なスピードでも主要な内容を理解できる",
        "複数の話者のやり取りを追うことができる"
      ],
      "weakness": [
        "雑音がある環境では理解が難しい",
        "未知のトピックでは内容把握が困難",
        "キーワード中心で理解する傾向がある",
        "速い会話では細部を聞き逃すことがある",
        "慣用句やスラングの理解が不足している",
        "異なるアクセントへの適応が不十分",
        "抽象的な内容の理解が不安定である",
        "高度なリスニング練習がさらに必要"
      ]
    },
    "C1-C2": {
      "strength": [
        "さまざまなアクセントや話し方を理解できる",
        "話し手の意図や感情を正確に把握できる",
        "暗示や含意を聞き取ることができる",
        "複数人の議論や討論を理解できる",
        "ニュースや講義など幅広い音声に対応できる",
        "異なる情報を統合して理解できる",
        "微妙なトーンや文化的な示唆を理解できる",
        "補助なしで全体内容を把握できる"
      ],
      "weakness": [
        "非常に専門的なトピックでは理解が不安定",
        "非標準的な発音に対応する必要がある",
        "長時間の音声では集中力が途切れることがある",
        "語用的なニュアンスを見落とす場合がある",
        "文化的背景知識が必要な内容で理解が難しい",
        "ユーモアや皮肉の理解がやや不安定",
        "多義語の文脈理解に誤解が生じることがある",
        "専門的なリスニング能力の強化が望ましい"
      ]
    }
  },
  "grammar": {
    "A1-A2": {
      "strength": [
        "簡単な文を作ることができる",
        "現在形を正しく使える",
        "基本的な疑問文を作成できる",
        "基本的な構文で日常のことを表現できる",
        "形容詞を使って簡単に説明できる",
        "基本的な疑問文を形成できる",
        "be動詞と主要動詞を正しく使える",
        "簡単な動作について話すことができる",
        "助動詞（can, shouldなど）を簡単に使える"
      ],
      "weakness": [
        "語順の誤りが見られる",
        "動詞の形を誤ることが多い",
        "前置詞や冠詞の使い方が不安定である",
        "助動詞を省略する傾向がある",
        "複数形の使用に誤りがある",
        "接続詞の使用に支援が必要である",
        "現在形と過去形を混同する",
        "主語と動詞の一致が不安定である",
        "時制を切り替える際に混乱が見られる"
      ]
    },
    "B1-B2": {
      "strength": [
        "複数の時制を正確に使い分けられる",
        "複文や複雑な文を適切に構成できる",
        "受動態を正しく使用できる",
        "間接話法を理解し使用できる",
        "条件文を適切に使える",
        "動名詞と不定詞を使い分けられる",
        "比較級・最上級を正しく使用できる",
        "丁寧な依頼や間接疑問文を形成できる",
        "接続詞を効果的に使って論理的に話せる",
        "分詞構文を使って文を修飾できる"
      ],
      "weakness": [
        "動詞の時制を混同することがある",
        "高レベルの条件文の使用が不安定である",
        "主語と動詞の一致を誤ることがある",
        "文法の正確さに一貫性が欠ける場合がある",
        "関係代名詞の使用に誤りがあることがある",
        "句動詞の習得にさらなる練習が必要である",
        "冠詞（a, an, the）の使い分けが難しい",
        "簡単な文構造に頼る傾向がある",
        "前置詞の脱落が見られることがある",
        "フォーマルとインフォーマルの文法の使い分けが不安定"
      ]
    },
    "C1-C2": {
      "strength": [
        "高度な文構造を効果的に使いこなせる",
        "あらゆる時制を正確に使用できる",
        "倒置構文を強調表現として使える",
        "助動詞を使い分けて意味の微妙な違いを表現できる",
        "複雑な関係節を正確に使える",
        "接続表現を多様に使いこなしている",
        "語順の使い方が自然で文脈に適している",
        "多様な節構造を活用できる",
        "フォーマルとインフォーマルの文体を使い分けられる",
        "高い流暢さを保ちながら文法の正確さを維持している"
      ],
      "weakness": [
        "文の構造が複雑になりすぎることがある",
        "受動態を過度に使用する傾向がある",
        "高度な条件文の使用に誤りが見られることがある",
        "まれな文法構造の使用に精度が不足することがある",
        "フォーマルな表現を過剰に使うことがある",
        "日常会話で複雑な文を使いすぎる傾向がある",
        "慣用的な文法表現における細かな誤りがある",
        "文法選択に慎重すぎる場合がある",
        "発話中に自己修正する傾向がある",
        "難解な文法規則を使う際にためらいが見られる"
      ]
    }
  },
  "speaking": {
    "A1-A2": {
      "strength": [
        "身近な話題について短い文で答えることができる（例：家族・趣味・日常生活）",
        "限られた語彙でも基本的な考えを伝えようとする姿勢がある",
        "簡単な発音やイントネーションを模倣できる",
        "簡単な質問や指示に答えることができる",
        "繰り返しやジェスチャーを使って基本的なやり取りを維持できる"
      ],
      "weakness": [
        "文構造が単純で内容が限定的である",
        "教師の支援や翻訳が必要な場面が多い",
        "発音やアクセントの誤りが理解を妨げる場合がある",
        "発話の連続性が乏しく、しばしば沈黙が生じる",
        "聞き取れないときに適切な補修ストラテジーを用いられない"
      ]
    },
    "B1-B2": {
      "strength": [
        "身近な話題について流暢に意見や理由を述べることができる",
        "接続語や遷移表現（however, in additionなど）を使って話を展開できる",
        "発音やイントネーションが自然で聞き取りやすい",
        "質問に即座に反応し、会話を発展させることができる",
        "比喩や慣用表現を適切に用いることができる"
      ],
      "weakness": [
        "複雑な話題では言葉を探す時間が必要になる",
        "話す速度や抑揚が安定せず、聞き手に違和感を与える場合がある",
        "語の選択が不自然または曖昧な場合がある",
        "文法的誤りが流暢さに影響を与えることがある",
        "フォーマルな場面で自然な言い回しを欠く場合がある"
      ]
    },
    "C1-C2": {
      "strength": [
        "複雑な考えや意見を自信をもって自然に表現できる",
        "発音・イントネーションが非常に自然で母語話者に近い",
        "状況や相手に応じて話し方を柔軟に変えられる",
        "高度な語彙と文構造を使って滑らかに話せる",
        "議論や再述など即時的な発話にも的確に対応できる"
      ],
      "weakness": [
        "抽象的なテーマでは発話を整理する時間が必要な場合がある",
        "正確さを意識しすぎて自然さが損なわれることがある",
        "わずかに非母語的な発音や抑揚が残ることがある",
        "長時間の発話でスピードやトーンが不均一になることがある",
        "文化的背景やユーモアのある表現の使用に課題が残る"
      ]
    }
  },
  "accuracy": {
    "A1-A2": {
      "strength": [
        "基本的な文型（主語＋動詞＋目的語）を用いて簡単な考えを伝えられる",
        "よく使う語彙を使って意思疎通ができる",
        "現在形・過去形などの基本的な時制を理解している",
        "スペリングと発音が概ね一致している",
        "積極的に英語で表現しようとする意欲がある"
      ],
      "weakness": [
        "動詞の時制や主語の一致に誤りが多い",
        "接続語（and, but, becauseなど）の使用が限られている",
        "語彙の繰り返しが多く、表現が単調である",
        "文構造が単純で文を展開しにくい",
        "文法規則の理解と応用に教師の支援が必要である"
      ]
    },
    "B1-B2": {
      "strength": [
        "基本的な文法（時制・比較・前置詞など）を正確に使用できる",
        "文構造に多様性があり、考えを論理的につなげることができる",
        "自分の誤りに気づいて修正できる",
        "抽象的な概念や意見を正確な語で表現できる",
        "発音とリズムが明瞭で理解しやすい"
      ],
      "weakness": [
        "冠詞や前置詞の誤りが自然さに影響を与える場合がある",
        "語の選択が精度に欠けることがある",
        "複雑な文型（条件文・受動態など）を使う際に誤りがある",
        "長い発話や作文で一貫性が欠けることがある",
        "イントネーションや文の流れがやや不自然な場合がある"
      ]
    },
    "C1-C2": {
      "strength": [
        "ほぼ誤りなく高度な文法構造を使いこなせる",
        "語彙の選択が的確で、文脈に応じて調整できる",
        "自然な慣用句やコロケーションを適切に使用できる",
        "文の構成が滑らかで論理的に整理されている",
        "フォーマル・インフォーマルな表現を自在に使い分けられる"
      ],
      "weakness": [
        "非常に複雑な文で小さな誤りが見られることがある",
        "母語からの直訳的な表現が稀に出る",
        "微妙な文法の差異に注意が必要である",
        "不慣れな話題では流暢さがやや低下する",
        "正確さを意識しすぎて自然な表現が減る傾向がある"
      ]
    }
  }
}
